{
  "source": "OBSE",
  "elements": [
    {
      "name": "IsRefEssential",
      "description": " - returns whether the referenced actor is essential"
    },
    {
      "name": "SetRefEssential",
      "description": " - sets the calling ref to be essential or not"
    },
    {
      "name": "GetActorLightAmount",
      "description": " - returns a float describing the amount of light falling on an actor, or 100 if the actor is not in high/medium-high process."
    },
    {
      "name": "CanCorpseCheck",
      "description": " - returns 1 if the Can Corpse Check flag is set on the actor"
    },
    {
      "name": "SetCanCorpseCheck",
      "description": " - changes the Can Corpse Check flag on the actor"
    },
    {
      "name": "GetActorMinLevel",
      "description": " - returns the minimum level of the actor if the PC Level Offset flag is set"
    },
    {
      "name": "GetActorMaxLevel",
      "description": " - returns the maximum level of the actor if the PC Level Offset flag is set"
    },
    {
      "name": "GetNumFactions",
      "description": " - returns the number of factions to which the actor belongs"
    },
    {
      "name": "GetNthFaction",
      "description": " - returns the nth faction to which the actor belongs"
    },
    {
      "name": "GetActorSoulLevel",
      "description": " - returns the soul level of any actor. If an NPC it returns Grand, otherwise if a creature it returns the creature's soul level."
    },
    {
      "name": "HasLowLevelProcessing",
      "description": " - returns 1 if the actor has low level processing enabled"
    },
    {
      "name": "HasNoPersuasion",
      "description": " - returns 1 if the No Persuasion flag is set on the actor"
    },
    {
      "name": "SetNoPersuasion",
      "description": " - changes the No Persuasion flag on the actor"
    },
    {
      "name": "IsActorRespawning",
      "description": " - returns 1 if the Respawn flag is set on the actor"
    },
    {
      "name": "IsPCLevelOffset",
      "description": " - returns 1 if the actor's level is calculated relative to the player's level"
    },
    {
      "name": "GetActorBaseLevel",
      "description": " - returns the level of the base actor. In the editor, for creatures this is the \"Level Offset\" field; for NPCs it is the \"Level\" field. For either, the meaning of the return value depends on whether or not the PC Level Offset flag is set for the base actor."
    },
    {
      "name": "IsSummonable",
      "description": " - returns 1 if the Summonable flag is set on the actor"
    },
    {
      "name": "SetSummonable",
      "description": " - changes the Summonable flag on the actor"
    },
    {
      "name": "SetActorRespawns",
      "description": " - changes the Respawn flag on the actor"
    },
    {
      "name": "SetFemale",
      "description": " - changes the Female flag on the actor. Changes are saved but may not be immediately visible."
    },
    {
      "name": "SetLowLevelProcessing",
      "description": " - turns low level processing on or off for the actor. Note that this sets the No Low Level Processing flag to the opposite of the passed value."
    },
    {
      "name": "SetPCLevelOffset",
      "description": " - changes the PC Level Offset flag on the actor, and optionally specifies the minimum andmaximum levels. If minLevel or maxLevel is omitted or passed as -1, the existing value will be retained."
    },
    {
      "name": "GetNumPackages",
      "description": " - returns the number of AI packages in the actor's package list"
    },
    {
      "name": "GetNthPackage",
      "description": " - returns the Nth AI package in the NPC's package list, in the order in which they were added in the editor."
    },
    {
      "name": "GetSpellEffectiveness",
      "description": " - returns the actor's spell effectiveness based on the armor he or she has equipped as a floating point value from 0 to 1.0. The return value is always 1.0 for creatures and NPCs other than the player. When calledon the player, this command returns the player's base spell effectiveness as calculated by the game plus any script modifier applied by ModPCSpellEffectiveness."
    },
    {
      "name": "CanCastPower",
      "description": " - returns false if the calling actor has already used the specified greater power within the last 24 hours. This command does not check for the presence of the greater power in the actor's spellbook."
    },
    {
      "name": "SetCanCastPower",
      "description": " - indicates whether the calling actor can cast the specified greater power. Passing 1 allows the actor to cast the power even if he has already used it within the past 24 hours. Passing 0 disallows the actor from casting the spell for the next 24 hours, unless the actor has already cast the power, in which case the power will become usable as normal 24 hours after the last casting."
    },
    {
      "name": "SetPowerTimer",
      "description": " - sets the amount of time that must pass until the calling actor can cast the specified power. The time is a float representing the number of real-time seconds until the power becomes usable. When an actor uses a power, the game calculates the 24-hour timer as "
    },
    {
      "name": "GetUsedPowers",
      "description": " - returns an Array containing information about all greater powers which the calling actor has used. This includes powers cast by the actor within the last 24 hours as well as any powers flagged as used by SetCanCastPower and SetPowerTimer. The return value is an Array of StringMaps:"
    },
    {
      "name": "HasSpell",
      "description": " - returns whether the actor has the specified spell"
    },
    {
      "name": "IsDiseased",
      "description": " - returns whether the actor has a disease"
    },
    {
      "name": "RemoveBaseSpell",
      "description": " - the game's RemoveSpell removes a spell from a base actor but must be called on a reference. This command does the same thing as RemoveSpell but takes a base object as an argument, returning 1 if the spell was removed."
    },
    {
      "name": "GetLeveledSpells",
      "description": " - returns an Array containing all of the leveled spells in the base actor's spell list."
    },
    {
      "name": "GetActorPackages",
      "description": " - returns an Array containing the AI packages defined in the base actor's package list, in the order in which they are listed in the editor."
    },
    {
      "name": "GetCurrentPackage",
      "description": " - returns the actor ref's currently executing package"
    },
    {
      "name": "GetCurrentPackageProcedure",
      "description": " - returns the name of the "
    },
    {
      "name": "GetCurrentEditorPackage",
      "description": " - returns the actor ref's executing non-dynamic package"
    },
    {
      "name": "EquipItem2",
      "description": " - duplicates the behavior of the vanilla "
    },
    {
      "name": "EquipItem2NS",
      "description": " - behaves identically to "
    },
    {
      "name": "GetSpecialAnims",
      "description": " - returns an Array containing the filenames of any special animations for the actor. Animations for creatures, and those in the SpecialAnims folder for NPCs, can be toggled on and off in the actor's animation list in the editor."
    },
    {
      "name": "ToggleSpecialAnim",
      "description": " - adds or removes an animation from the base actor's animation list. For creatures, the animations must appear in the creature's model folder; for NPCs they must be located in the Special Anims folder. Changes made using this command have no effect on the animations of reference's to the base actor which are currently in middle-high or high process."
    },
    {
      "name": "GetGroundSurfaceMaterial",
      "description": " - returns the "
    },
    {
      "name": "GetFactions",
      "description": " - returns an array containing the factions the calling ref or base actor is a member of."
    },
    {
      "name": "GetActorSwimBreath",
      "description": " - returns the calling high process actor's swimming breath level in seconds."
    },
    {
      "name": "SetActorSwimBreath",
      "description": " - sets the calling high process actor's swimming breath level."
    },
    {
      "name": "GetActorMaxSwimBreath",
      "description": " - returns the calling high process actor's maximum swimming breath level  in seconds."
    },
    {
      "name": "SetActorMaxSwimBreath",
      "description": " - sets the calling high process actor's maximum swimming breath level. Overrides are automatically cleared when the actor leaves the high process AI processing band."
    },
    {
      "name": "OverrideActorSwimBreath",
      "description": " - overrides the "
    },
    {
      "name": "GetAVMod",
      "description": " - returns one of the calling actor's modifiers for the specified actor value. The modifier is specified as a string: \"script\" refers to the script (or \"offset\") modifier applied by the "
    },
    {
      "name": "SetAVMod",
      "description": " - sets the value of one of the calling actor's modifiers for the specified actor value. The modifier is specified as a string: \"script\" refers to the script (or \"offset\") modifier applied by the "
    },
    {
      "name": "ModAVMod",
      "description": " - modifies the value of one of the calling actor's modifiers for the specified actor value by the specified amount. The modifier is specified as a string: \"script\" refers to the script (or \"offset\") modifier applied by the "
    },
    {
      "name": "GetMaxAV",
      "description": " - returns the maximum possible value of the specified actor value for the calling actor."
    },
    {
      "name": "GetAVForBaseActor",
      "description": " - returns the value of the specified actor value as defined for the base actor. If the second argument is omitted, the base object for the calling actor is used. Note that not all actor values are defined for base actors, in which case this command returns 0."
    },
    {
      "name": "GetActorValueC",
      "description": " - returns the actor value specified by the actor value code"
    },
    {
      "name": "ModActorValueC",
      "description": " - modifies the actor value without changing the base value. Acts like a spell: a negative number reduces the value which can be restored and a positive value restores values without exceeding the maximum of the stat."
    },
    {
      "name": "SetActorValueC",
      "description": " - sets the actor value specified by the actor value code"
    },
    {
      "name": "ModActorValue2",
      "description": " - modifies the current value without changing the base value. Acts like a spell: a negative number reduces the value which can be restored and a positive value restores values without exceeding the maximum of the stat."
    },
    {
      "name": "GetLuckModifiedSkill",
      "description": " - the game applies a modifier to all skills based on an actor's luck attribute. This command takes an actual skill value and a luck attribute value and calculates the effective level of the skill after the luck modifier has been applied. The third parameter can be used to return an uncapped value - The result is capped at 100 by default."
    },
    {
      "name": "GetAVSkillMasteryLevel",
      "description": " - returns the current mastery level of an actor's skill. The mastery level is an integer from 0 (Novice) to 4 (Master)."
    },
    {
      "name": "GetAVSkillMasteryLevelC",
      "description": " - alternate version of GetAVSkillMasteryLevel taking an actor value for the skill."
    },
    {
      "name": "GetAttackDamage",
      "description": " - returns the base attack damage"
    },
    {
      "name": "SetAttackDamage",
      "description": " - sets the base attack damage"
    },
    {
      "name": "ModAttackDamage",
      "description": " - modifies the base attack damage up or down"
    },
    {
      "name": "GetWeaponSpeed",
      "description": " - returns the weapon speed"
    },
    {
      "name": "SetWeaponSpeed",
      "description": " - sets the weapon speed"
    },
    {
      "name": "ModWeaponSpeed",
      "description": " - modifies the weapon speed up or down"
    },
    {
      "name": "GetIgnoresResistance",
      "description": " - returns whether the object ignores normal damage resistance"
    },
    {
      "name": "SetIgnoresResistance",
      "description": " - sets whether the object ignores normal damage resistance"
    },
    {
      "name": "GetOpenSound",
      "description": " - Returns the \"open\" sound"
    },
    {
      "name": "GetCloseSound",
      "description": " - Returns the \"close\" sound"
    },
    {
      "name": "GetLoopSound",
      "description": " - Returns the looping sound"
    },
    {
      "name": "SetOpenSound",
      "description": " - Sets the \"open\" sound"
    },
    {
      "name": "SetCloseSound",
      "description": " - Sets the \"close\" sound"
    },
    {
      "name": "SetLoopSound",
      "description": " - Sets the looping sound"
    },
    {
      "name": "GetObjectHealth",
      "description": " - returns the base object health"
    },
    {
      "name": "SetObjectHealth",
      "description": " - sets the base object health"
    },
    {
      "name": "ModObjectHealth",
      "description": "  - modifies the base object health up or down"
    },
    {
      "name": "GetCurrentHealth",
      "description": " - returns the current health of the calling reference"
    },
    {
      "name": "SetCurrentHealth",
      "description": " - sets the current health of the calling reference"
    },
    {
      "name": "GetEquippedCurrentHealth",
      "description": " -  gets the current health of the object in the specified equipment slot"
    },
    {
      "name": "SetEquippedCurrentHealth",
      "description": " - sets the current health of the object in the specified equipment slot"
    },
    {
      "name": "ModEquippedCurrentHealth",
      "description": " - modifies the current health of the object in the specified equipment slot up or down "
    },
    {
      "name": "GetClass",
      "description": " - returns the class of the NPC "
    },
    {
      "name": "GetClassAttribute",
      "description": " - returns the Nth attribute of the class. If called on a reference it will attempt to find the class from that referenced NPC and use that. If a class FormID is passed, that takes precedence."
    },
    {
      "name": "GetClassSkill",
      "description": " - returns the Nth skill of the class. If called on a reference it will attempt to find the class from that referenced NPC and use that. If a class FormID is passed, that takes precedence."
    },
    {
      "name": "GetClassSpecialization",
      "description": " - returns the class specialization. If called on a reference it will attempt to find the class from that referenced NPC and use that. If a class FormID is passed, that takes precedence."
    },
    {
      "name": "IsClassSkill",
      "description": " - returns whether the passed skill is a skill of the class. If called on a reference it will attempt to find the class from that referenced NPC and use that. If a class FormID is passed, that takes precedence."
    },
    {
      "name": "IsMajorRef",
      "description": " - returns whether the passed skill is a skill of the class of the called on a reference."
    },
    {
      "name": "IsClassSkillC",
      "description": " - alternate version of IsClassSkill taking a skill code instead of the name of a skill."
    },
    {
      "name": "IsClassAttribute",
      "description": " - returns whether the passed attribute is an attribute of the class. If called on a reference it will attempt to find the class from that referenced NPC and use that. If a class FormID is passed, that takes precedence. (available in v0011)"
    },
    {
      "name": "IsClassAttributeC",
      "description": " - alternate version of "
    },
    {
      "name": "GetClassSkills",
      "description": " - returns an Array containing the seven major skills associated with the class. If the parameter is omitted, the class of the calling NPC is used."
    },
    {
      "name": "SetClassSkills",
      "description": " - accepts an Array of seven different skill codes and sets them as the class's major skills. If fewer or more than seven skills are found in the array or duplicate skills are found, the function will return zero with no changes made to the class. If the class argument is omitted, the calling NPC's class is used."
    },
    {
      "name": "SetClassSkills2",
      "description": " - Identical to SetClassSkills, except it allows duplicate skills."
    },
    {
      "name": "SetClassSpecialization",
      "description": " - sets the class specialization. If the class argument is omitted thecalling NPC's class is used."
    },
    {
      "name": "SetClassAttribute",
      "description": " - sets one of the two favored attributes for the class. Both class attributes must be unique. If the class argument is omitted the calling NPC's class is used."
    },
    {
      "name": "SetClassAttributeC",
      "description": " - as SetClassAttribute but takes an actor value code instead of an actor value string."
    },
    {
      "name": "GetNumItems",
      "description": " - returns the number of different object types in the container or actor's inventory."
    },
    {
      "name": "GetInventoryObject",
      "description": " - returns the objectID of the Nth item type in the container or actor's inventory"
    },
    {
      "name": "IsContainer",
      "description": " - returns whether the reference or passed objectID is a container."
    },
    {
      "name": "GetContainerRespawns",
      "description": " - returns whether the container's contents repawn."
    },
    {
      "name": "SetContainerRespawns",
      "description": " - sets whether the container's contents respawn."
    },
    {
      "name": "GetItems",
      "description": " - returns an Array containing all of the items in a container's or actor's inventory. Up to 10 form types may be passed in to restrict the returned items to only include items matching those type(s)."
    },
    {
      "name": "GetBaseItems",
      "description": " - returns an Array of StringMaps containing the items present in a base container or actor's inventory and the quantity of each. These are the items added to the base object in the editor and may include leveled items. Some, all, or none of the items may be present in the inventory of a specific reference to the base object. Each element of the returned Array is a StringMap with two elements:"
    },
    {
      "name": "GetDescription",
      "description": " - returns the text of the description for the object. In the case of skills, an optional second parameter indicates the skill rank (0-3); if omitted, the skill's general description is returned."
    },
    {
      "name": "SetDescription",
      "description": " - modifies the text of a TESDescription (e.g. book, class, skill, skill level, etc). The modified description will be used for the remainder of the game session. To modify the text displayed when achieving a new level of mastery (Apprentice, Journeyman, etc) in a skill, pass the skill as the second argument and a skill level as the third, where skill level ranges from 0 (Apprentice) to 3 (Master)"
    },
    {
      "name": "IsFood",
      "description": " - returns whether the object is considered to be food"
    },
    {
      "name": "SetIsFood",
      "description": " - sets whether the object is considered to be food"
    },
    {
      "name": "GetEnchantment",
      "description": " - returns the specific enchantment on the object"
    },
    {
      "name": "SetEnchantment",
      "description": " - sets the specific enchantment on the object and returns any previous enchantment"
    },
    {
      "name": "RemoveEnchantment",
      "description": " - removes the enchantment from the object and returns any previous enchantment"
    },
    {
      "name": "GetObjectCharge",
      "description": " - returns the max charge of the object"
    },
    {
      "name": "SetObjectCharge",
      "description": " - sets the max charge of the object"
    },
    {
      "name": "ModObjectCharge",
      "description": " - modifies the max charge of the object up or down"
    },
    {
      "name": "GetCurrentCharge",
      "description": " - returns the current charge of the calling reference"
    },
    {
      "name": "GetEquippedCurrentCharge",
      "description": " - returns the current charge of the object in the specified slot"
    },
    {
      "name": "SetEquippedCurrentCharge",
      "description": " - sets the current charge of the object in the specified slot"
    },
    {
      "name": "ModEquippedCurrentCharge",
      "description": " - modifies the current charge of the object in the specified slot up or down"
    },
    {
      "name": "SetCurrentCharge",
      "description": " - sets the current charge of the calling reference if it is less than or equal to the maximum charge"
    },
    {
      "name": "ModCurrentCharge",
      "description": " - modifies the current charge of the calling reference by the specified amount. Will not modify the charge past its maximum or below zero."
    },
    {
      "name": "GetEquipmentSlot",
      "description": " - returns the equipment slot or slots taken by the object"
    },
    {
      "name": "SetEquipmentSlot",
      "description": " - sets the equipment slot or slots taken by the object."
    },
    {
      "name": "EquipMe",
      "description": " - when called on an object in an actor's inventory, attempts to equip the object on the actor and runs the object's "
    },
    {
      "name": "UnequipMe",
      "description": " - when called on an object in an actor's inventory, attempts to unequip the object on the actor and runs the object's "
    },
    {
      "name": "GetBaseObject",
      "description": " - returns the base object of the reference."
    },
    {
      "name": "GetObjectType",
      "description": " - returns a type code for each type of object."
    },
    {
      "name": "IsWeapon",
      "description": " - returns whether the object is a weapon."
    },
    {
      "name": "IsAmmo",
      "description": " - returns whether the object is ammunition."
    },
    {
      "name": "IsArmor",
      "description": " - returns whether the object is armor."
    },
    {
      "name": "IsBook",
      "description": " - returns whether the object is a book."
    },
    {
      "name": "IsClothing",
      "description": " - returns whether the object is clothing."
    },
    {
      "name": "IsIngredient",
      "description": " - returns whether the object is an ingredient."
    },
    {
      "name": "IsKey",
      "description": " - returns whether the object is a key."
    },
    {
      "name": "IsAlchemyItem",
      "description": " - returns whether the object is an alchemy item (potion)."
    },
    {
      "name": "IsApparatus",
      "description": " - returns whether the object is an alchemy apparatus."
    },
    {
      "name": "IsSoulGem",
      "description": " - returns whether the object is a soul gem."
    },
    {
      "name": "IsSigilStone",
      "description": " - returns whether the object is a sigil stone."
    },
    {
      "name": "IsMiscItem",
      "description": " - returns whether the object is a miscellaneous item."
    },
    {
      "name": "IsLight",
      "description": " - returns whether the object is a light source."
    },
    {
      "name": "IsFlora",
      "description": " - returns 1 if the object is a harvestable plant."
    },
    {
      "name": "GetWeight",
      "description": " - returns the weight of the type."
    },
    {
      "name": "SetWeight",
      "description": " - sets the weight of the type."
    },
    {
      "name": "ModWeight",
      "description": " - modifies the weight of the type up or down."
    },
    {
      "name": "GetGoldValue",
      "description": " - returns the base gold value of the type."
    },
    {
      "name": "GetFullGoldValue",
      "description": " - returns the full gold value of an item, including the value added by enchantments."
    },
    {
      "name": "SetGoldValue",
      "description": " - sets the base gold value of the type."
    },
    {
      "name": "ModGoldValue",
      "description": " - modifies the base gold value of the type up or down."
    },
    {
      "name": "IsQuestItem",
      "description": " - returns whether the type is a quest item."
    },
    {
      "name": "SetQuestItem",
      "description": " - sets whether the type is a quest item."
    },
    {
      "name": "SetCurrentSoulLevel",
      "description": " - sets the current soul level of the calling soulgem reference."
    },
    {
      "name": "GetOpenKey",
      "description": " - returns the key used to unlock the calling reference."
    },
    {
      "name": "SetOpenKey",
      "description": " - sets the key used to unlock the reference to the specified key."
    },
    {
      "name": "GetMagicItemType",
      "description": " - returns the magic item type."
    },
    {
      "name": "GetMagicItemEffectCount",
      "description": " -  returns the number of magic effect items."
    },
    {
      "name": "MagicItemHasEffect",
      "description": " - returns whether the magic item has an effect item with the specifed effect. Uses the 4 letter codes for the magic effects listed in the CS. Uses an optional actor value name for use with effects like fortify skill and fortify attribute."
    },
    {
      "name": "MagicItemHasEffectCode",
      "description": " - returns whether the magic item has an effect item with the specified effect code. Uses a long value returned from "
    },
    {
      "name": "MagicItemHasEffectCount",
      "description": " - returns the count of the specified effects on the magic item. Has an optional actorValue name for use with effects like fortify skill and fortify attribute."
    },
    {
      "name": "MagicItemHasEffectCountCode",
      "description": " -  returns the count of effects with the specified effect code on the magic item. Uses a long value returned from "
    },
    {
      "name": "GetNthEffectItemCode",
      "description": " - returns the magic effect code of the specified effect item."
    },
    {
      "name": "GetNthEffectItemMagnitude",
      "description": " - returns the magnitude of the specified effect item."
    },
    {
      "name": "SetNthEffectItemMagnitude",
      "description": " - sets the magnitude of the specified effect item."
    },
    {
      "name": "ModNthEffectItemMagnitude",
      "description": " - modifies the magnitude of the specified effect item up or down."
    },
    {
      "name": "GetNthEffectItemArea",
      "description": " - returns the area of the specified effect item."
    },
    {
      "name": "SetNthEffectItemArea",
      "description": " - sets the area of the specified effect item."
    },
    {
      "name": "ModNthEffectItemArea",
      "description": " - modifies the effect area of the specified effect item up or down."
    },
    {
      "name": "GetNthEffectItemDuration",
      "description": " - returns the duration of the specified effect item."
    },
    {
      "name": "SetNthEffectItemDuration",
      "description": " - sets the duration of the specified effect item."
    },
    {
      "name": "ModNthEffectItemDuration",
      "description": " - modifies the duration of the specified effect item up or down."
    },
    {
      "name": "GetNthEffectItemRange",
      "description": " - gets the range of the specified effect item."
    },
    {
      "name": "SetNthEffectItemRange",
      "description": " - sets the range of the specified effect item."
    },
    {
      "name": "GetNthEffectItemActorValue",
      "description": " - gets the actor value of the specified effect item."
    },
    {
      "name": "SetNthEffectItemActorValue",
      "description": " - sets the actor value of the specified effect item."
    },
    {
      "name": "SetNthEffectItemActorValueC",
      "description": " - sets the actor value of the specified effect item."
    },
    {
      "name": "RemoveNthEffectItem",
      "description": " - removesthe specified effect item."
    },
    {
      "name": "RemoveAllEffectItems",
      "description": " - removes all effect items from the magic item."
    },
    {
      "name": "CopyNthEffectItem",
      "description": " - copies the specified effect item from one magic item to another."
    },
    {
      "name": "CopyAllEffectItems",
      "description": " - copies all effect items from one magic item to another."
    },
    {
      "name": "AddEffectItem",
      "description": " - adds a basic, empty EffectItem of the specified MagicEffect to the magic item."
    },
    {
      "name": "AddFullEffectItem",
      "description": " - adds a fully defined EffectItem to the magic item with the specified MagicEffect, magnitude, area, duration and range."
    },
    {
      "name": "IsMagicItemAutoCalc",
      "description": " - returns 1 if the MagicItem determines magicka cost by autocalculation. Now works on all Magic Items (Spells, Alchemy, Ingredients, Enchantments)."
    },
    {
      "name": "SetMagicItemAutoCalc",
      "description": " - sets whether the Magic Item determines cost by autocalculation. Currently works for Spells, AlchemyItems, Ingredients and Enchantments."
    },
    {
      "name": "IsNthEffectItemScripted",
      "description": " - returns whether the specified effect item is scripted."
    },
    {
      "name": "GetNthEffectItemScript",
      "description": " - returns the refID of the script associated with the specified scripted effect."
    },
    {
      "name": "SetNthEffectItemScript",
      "description": " - sets the script for the specified scripted effect item. Note that the CS doesn't have a variable type for a script, so you must assign the script editor id to a ref variable to use this function."
    },
    {
      "name": "GetNthEffectItemScriptVisualEffect",
      "description": " - returns the magic effect code for the scripted effect item's visual effect."
    },
    {
      "name": "SetNthEffectItemScriptVisualEffect",
      "description": " - sets the scrited effect item's visual effect."
    },
    {
      "name": "GetNthEffectItemScriptSchool",
      "description": " - returns the school of the scripted effect item."
    },
    {
      "name": "SetNthEffectItemScriptSchool",
      "description": " - sets the school of the scripted effect item."
    },
    {
      "name": "IsNthEffectItemScriptHostile",
      "description": " - returns whether the scripted effect is hostile."
    },
    {
      "name": "SetNthEffectItemScriptHostile",
      "description": " - sets whether the scripted effect is hostile."
    },
    {
      "name": "GetNthEffectItemScriptName",
      "description": " - returns the name of the nth effect item, provided that effect item is a script effect."
    },
    {
      "name": "SetNthEffectItemScriptName",
      "description": " - sets the name of the scripted effect."
    },
    {
      "name": "SetNthEffectItemScriptNameEX",
      "description": " - sets the name of the scripted effect."
    },
    {
      "name": "ModNthEffectItemScriptName",
      "description": " - modifies the name of the scripted effect. The "
    },
    {
      "name": "MagicItemHasEffectItemScript",
      "description": " - returns 1 if the magic effect has a scripted item with the specified script."
    },
    {
      "name": "GetNthEffectItemName",
      "description": " - returns the name of the specified active effect, i.e. \"Fortify Strength\"."
    },
    {
      "name": "GetNthEffectItem",
      "description": " - returns a StringMap fully describing the specified effect item. The StringMap has the following key-value pairs:"
    },
    {
      "name": "GetActiveEffectCount",
      "description": " - returns the number of ActiveEffects on the target"
    },
    {
      "name": "GetNthActiveEffectCode",
      "description": " - returns the effect of the Nth ActiveEffect on the target"
    },
    {
      "name": "GetNthActiveEffectMagnitude",
      "description": " - returns the magnitude of the Nth ActiveEffect on the target"
    },
    {
      "name": "GetNthActiveEffectDuration",
      "description": " - returns the total duration of the Nth ActiveEffect on the target"
    },
    {
      "name": "GetNthActiveEffectTimeElapsed",
      "description": " - returns the time that the Nth ActiveEffect has been applied to the target"
    },
    {
      "name": "GetNthActiveEffectMagicItem",
      "description": " - returns the magic item which applied theNth ActiveEffect to the target"
    },
    {
      "name": "GetNthActiveEffectCaster",
      "description": " - return the caster of the Nth ActiveEffect on the target"
    },
    {
      "name": "GetNthActiveEffectData",
      "description": " - return the data of the NthActiveEffect on the target"
    },
    {
      "name": "GetNthActiveEffectMagicItemIndex",
      "description": " - returns the index on its magic item of the Nth ActiveEffect on the target"
    },
    {
      "name": "GetNthActiveEffectEnchantObject",
      "description": " - returns the equipped enchanted object, if any, responsible for the specified active effect"
    },
    {
      "name": "SetNthActiveEffectMagnitude",
      "description": " - sets the magnitude of the corresponding ActiveEffect"
    },
    {
      "name": "ModNthActiveEffectMagnitude",
      "description": " - modifies the magnitude of the corresponding ActiveEffect"
    },
    {
      "name": "GetTotalActiveEffectMagnitude",
      "description": " - returns the total magnitude of all ActiveEffects with a given code on the target"
    },
    {
      "name": "GetTotalAENonAbilityMagnitude",
      "description": " - returns the total magnitude of all non-ability ActiveEffects with a given code on the target"
    },
    {
      "name": "GetTotalAEAbilityMagnitude",
      "description": " - returns the total magnitude of all ability ActiveEffects with a given code on the target"
    },
    {
      "name": "GetTotalAESpellMagnitude",
      "description": " - returns the total magniude of all spell ActiveEffects with a given code on the target"
    },
    {
      "name": "GetTotalAEDiseaseMagnitude",
      "description": " - returns the total magnitude of all disease ActiveEffects with a given code on the target."
    },
    {
      "name": "GetTotalAELesserPowerMagnitude",
      "description": " - returns the total magnitude of all lesser power ActiveEffects with a given code on the target"
    },
    {
      "name": "GetTotalAEPowerMagnitude",
      "description": " - retuns the total magnidue of all greater power ActiveEffects with a given code on the target"
    },
    {
      "name": "GetTotalAEAllSpellsMagnitude",
      "description": " - returns the total magnitude of all spells (Spell, Ability, Disease, Lesser Power, Power) with a given code on the target."
    },
    {
      "name": "GetTotalAEEnchantmentMagnitude",
      "description": " - retuns the total magnitude of all enchantments with a given code on the target."
    },
    {
      "name": "GetTotalAEAlchemyMagnitude",
      "description": " - returns the total magnitude of all potions with a given code on the target."
    },
    {
      "name": "GetScriptActiveEffectIndex",
      "description": " - returns the index of the corresponding ActiveEffect for the running script effect. Prior to OBSE 0019, this command returned 0 if the script effect could not be found, and could not distinguish between multiple instances of the same script effect. As of 0019, the command returns -1 on failure, and otherwise returns the index corresponding to the unique active effect associated with the calling script."
    },
    {
      "name": "DispelNthActiveEffect",
      "description": " - dispels the effects of the specified active effect and removes it from the actor's active effect list. Note that the effect will not be removed until the next gamemode frame, so the indexes into an actor's effect list do not change immediately."
    },
    {
      "name": "GetActiveEffectCodes",
      "description": " - returns an Array containing the effect code of each of the calling actor's active effects, in the order in which they appear in his active effect list. An effect code's index in the returned Array can therefore be passed to the Get/SetNthActiveEffectXXX functions to operate on its associated active effect."
    },
    {
      "name": "GetActiveEffectCasters",
      "description": " - returns an Array containing the casters of each of the calling actor's active effects, in the order in which they appear in his active effect list. A caster's index in the returned Array can therefore be passed to the Get/SetNthActiveEffectXXX functions to operate on its associated active effect. If an active effect has no caster its associated value will be zero."
    },
    {
      "name": "GetNthActiveEffectSummonRef",
      "description": " - returns a reference to the creature associated with the specified Summon Creature active effect"
    },
    {
      "name": "GetNthActiveEffectBoundItem",
      "description": " - returns the base object associated with the specified Bound Item active effect"
    },
    {
      "name": "IsNthActiveEffectApplied",
      "description": " - returns 1 if the active effect at the specified index is currently applied to the target. An active effect may exist on the target before its effects are applied (typically for one frame after a spell is cast), in which case this command would return zero."
    },
    {
      "name": "GetNthActiveEffectActorValue",
      "description": " - returns the actor value associated with the active effect, if any."
    },
    {
      "name": "SetName",
      "description": " - sets the display name of the type. SetName is a special function. It is defined to work on Inventory items, but it can be used with any form. To use with a non-Inventory item you must first assign the objectID to a ref. For most forms the name is part of the base form and changing the name will change it for all instances of the type. (TODO: AddLink)"
    },
    {
      "name": "GetName",
      "description": " - returns the name of an object."
    },
    {
      "name": "CompareName",
      "description": " - returns 1 if stringToFindInName is found in the name of the object"
    },
    {
      "name": "CompareNames",
      "description": " - compares the names of two objects and returns -1 if the first occurs alphabetically before the second, 1 if the first occurs after the second, or 0 for equality. Comparison is case-insensitive."
    },
    {
      "name": "CopyName",
      "description": " - copies the name from the source to the target. It is defined to work on Inventory items, but it can be used with any form. To use with a non-Inventory item you must first assign the objectID to a ref. For most forms the name is part of the base form and changing the name will change it for all instances of the type."
    },
    {
      "name": "ModName",
      "description": " - modifies the name of the calling reference or passed objectID. The toReplaceAndReplaceWith string has the following format: \"toReplace|replaceWith\". We will do a case insensitve search for the toReplace portion and if found will replace it with the replaceWith portion. The | character is used to separate the portions of the string. If there is nothing before the | character, the replaceWith string is prepended to the name. In the console, use @ instead of |."
    },
    {
      "name": "AppendToName",
      "description": " - appends the passed string to the end of the name of the calling reference or passed objectID."
    },
    {
      "name": "HasName",
      "description": " - returns 1 if the object has a id consisting of at least one character."
    },
    {
      "name": "SetNameEx",
      "description": " - sets the name of the base object. The new name is a string constructed from a format string using the same format specifiers used by OBSE's "
    },
    {
      "name": "GetOwner",
      "description": " - returns the NPC or faction which owns the calling reference."
    },
    {
      "name": "GetParentCellOwner",
      "description": " - returns the NPC or faction which owns the calling reference's parent cell."
    },
    {
      "name": "GetOwningFactionRequiredRank",
      "description": " - returns the rank in the owning faction required to legally activate the calling reference."
    },
    {
      "name": "GetParentCellOwningFactionRequiredRank",
      "description": " - returns the rank required for ownership of the calling reference's parent cell."
    },
    {
      "name": "SetOwningFactionRequiredRank",
      "description": " - set the rank in the owning faction required to legally activate the calling reference."
    },
    {
      "name": "SetParentCellOwningFactionRequiredRank",
      "description": " - set the rank required for ownership of the calling reference's parent cell."
    },
    {
      "name": "IsOffLimits",
      "description": " - returns 1 if it is illegal for the specified actor to activate the calling reference, based on the calling reference's ownership. If the argument is omitted, the player is used by default."
    },
    {
      "name": "GetRaceAttribute",
      "description": " - returns the specified base attribute value. If passed a raceFormID you must also pass whether you want the female value or not. If called directly on a reference the function will determine the race and sex of the reference and the raceFormID and isFemale are not needed. The C version of the function takes a number rather than the actorvalue name (ie. 0 instead of Strength)."
    },
    {
      "name": "GetRaceSkillBonus",
      "description": " - returns the bonus for the specified skill for the race. If called on a reference the function will determine the race of the reference. Returns 0 if there is no bonus for that skill. The C version specifies the specific skill by number rather than by name."
    },
    {
      "name": "IsRaceBonusSkill",
      "description": " - returns whether the specified skill is a bonus for the race. If called on a reference the function will determine the race of the reference. The C version specifies the skill by number rather than by name."
    },
    {
      "name": "GetNthRaceBonusSkill",
      "description": " - returns the actor value code for the specified index into the bonus skills. Can be followed up with a call to GetRaceSkillBonusC to determine the actual bonus to the skill. If called on a reference the function will determine the race of the reference."
    },
    {
      "name": "GetRaceSpellCount",
      "description": " - returns the number of spells provided by the race. If no race is specified, the race of the calling NPC is used."
    },
    {
      "name": "GetNthRaceSpell",
      "description": " - returns the nth spell provided by the race, using the race of the calling NPC if none is specified."
    },
    {
      "name": "SetRaceAlias",
      "description": " - creates an alias for a race. If a race has an alias, then calling "
    },
    {
      "name": "GetRaceVoice",
      "description": " - returns the race which is used to provide the voice of the specified race and gender. Pass 0 for male or 1 for female. "
    },
    {
      "name": " ",
      "description": "SetRaceVoice"
    },
    {
      "name": "SetRacePlayable",
      "description": " - flags a race as playable or unplayable. Unplayable races cannot speak most of the dialog defined in the game."
    },
    {
      "name": "IsRacePlayable",
      "description": " - returns 1 if the specified race is flagged as playable in the editor."
    },
    {
      "name": "GetRaceReaction",
      "description": " - returns the race reaction between the target NPC/Race and the calling NPC reference or passed race. The target and from races are declared as NPCs, but you can also place a Race name into a ref variable and pass those in."
    },
    {
      "name": "GetRaceScale",
      "description": " - returns the default scale of the male or female members of the specified race."
    },
    {
      "name": "SetRaceScale",
      "description": " - sets the scale for male or female members of the specified race."
    },
    {
      "name": "GetRaceWeight",
      "description": " - returns the default weight for male or female members of the specified race as defined in the editor."
    },
    {
      "name": "SetRaceWeight",
      "description": " - sets the weight for male or female members of the specified race."
    },
    {
      "name": "GetRaceDefaultHair",
      "description": " - returns the default hair for male or female members of the specified race."
    },
    {
      "name": "GetRaceHairs",
      "description": " - returns an Array of all hairs (male and female) available to actors of the specified race as defined in the editor."
    },
    {
      "name": "GetRaceEyes",
      "description": " - returns an Array of all eyes available to actors of the specified race as defined in the editor."
    },
    {
      "name": "HasTail",
      "description": " - returns true if the specified race or the race of the calling npc ref or specified base npc has a tail."
    },
    {
      "name": "GetTailModelPath",
      "description": " - returns the path to the tail model used by the specified gender of the specified race or the race of the specified NPC or calling reference, if the race has a tail."
    },
    {
      "name": "IsScripted",
      "description": " - returns whether the scriptable object has a script attached to it or not."
    },
    {
      "name": "GetScript",
      "description": " - returns the refID of the script attached to the object"
    },
    {
      "name": "RemoveScript",
      "description": " - removes and returns the script attached to the object. The object is no longer scripted"
    },
    {
      "name": "SetScript",
      "description": " - sets the specified script onto the calling object and returns any previous script. Note that Oblivion doesn't have a script variable type so you must assign the script to a ref variable for this to work."
    },
    {
      "name": "IsFormValid",
      "description": " - returns 1 if the specified ref variable contains a valid object or reference."
    },
    {
      "name": "IsReference",
      "description": " - returns 1 if the specified ref variable contains a reference, as opposed to a base object."
    },
    {
      "name": "HasVariable",
      "description": " - returns 1 if the calling reference or specified quest has a variable with the specified name."
    },
    {
      "name": "GetVariable",
      "description": " - returns the value of a numeric variable by name, either from the calling reference's script or the specified quest."
    },
    {
      "name": "GetRefVariable",
      "description": " - returns the reference stored in a ref variable by name, either from the calling reference's script or the specified quest."
    },
    {
      "name": "GetArrayVariable",
      "description": " (GetArrayVar) - returns the value of an array variable by name, either from the calling reference's script or the specified quest."
    },
    {
      "name": "CompareScripts",
      "description": " - compares the compiled code of two scripts and returns 1 if they are identical. Note that this doesn't mean the text of the scripts are identical, only that they call the same functions in the same order with the same parameters."
    },
    {
      "name": "ResetAllVariables",
      "description": " - sets all variables in the calling script to zero."
    },
    {
      "name": "GetNumExplicitRefs",
      "description": " -  returns the number of explicit references in the calling object's script or in the passed script object. Explicit references are any objects mentioned by name in the script; for instance, if a script contains an \"OnHit Player\" block or a \"Player.AddItem\" command, its explicit references will include the player."
    },
    {
      "name": "GetNthExplicitRef",
      "description": " - returns the "
    },
    {
      "name": "GetCurrentScript",
      "description": " - returns the script which is currently executing."
    },
    {
      "name": "SetModelPath",
      "description": " - sets the model path for the type."
    },
    {
      "name": "GetModelPath",
      "description": " - returns the model path for the object."
    },
    {
      "name": "SetIconPath",
      "description": " - sets the icon path for the type."
    },
    {
      "name": "GetIconPath",
      "description": " - returns the icon path for the object."
    },
    {
      "name": " ",
      "description": "CompareModelPath"
    },
    {
      "name": "CompareIconPath",
      "description": " - returns whether the passed string is part of the icon path. This is a case insensitive search."
    },
    {
      "name": "CopyModelPath",
      "description": " - sets the model path of the calling reference or passed objectID to the model path offromObject"
    },
    {
      "name": "CopyIconPath",
      "description": " - sets the icon path of the calling reference or passed objectID to the icon path of fromObject"
    },
    {
      "name": "ModModelPath",
      "description": " - modifies the model path of the calling reference or passed objectID. The "
    },
    {
      "name": "ModIconPath",
      "description": " - modifies the icon path of the calling reference or passed objectID. The "
    },
    {
      "name": "IsModelPathValid",
      "description": " - returns 1 if the model path for the object exists in the user's Data folder or within one of the BSA archives."
    },
    {
      "name": "IsIconPathValid",
      "description": " - returns 1 if the icon path for the object exists in the user's Data folder or within one of the BSA archives."
    },
    {
      "name": "GetTexturePath",
      "description": " - returns the texture path of an object. This command is identical to GetIconPath, but also works for other object types such as skills, classes, and miscellaneous objects."
    },
    {
      "name": "SetTexturePath",
      "description": " - sets the texture path of an object. This command works for a broader set of objects than SetIconPathEX."
    },
    {
      "name": "GetEditorSize",
      "description": " - returns the value contained in the hidden 'size' field of the editor's object window for the specified object. This is a rough scalar approximation of the dimensions of the object. Return value is typically similar to that of "
    },
    {
      "name": "SetMaleBipedPath",
      "description": " - sets the male NIF model path when worn"
    },
    {
      "name": "SetFemaleBipedPath",
      "description": " - sets the female NIF model path when worn"
    },
    {
      "name": "SetMaleGroundPath",
      "description": " - sets the male model path when dropped"
    },
    {
      "name": "SetFemaleGroundPath",
      "description": " - sets the female model path when dropped"
    },
    {
      "name": "SetMaleIconPath",
      "description": " - sets the male icon texture"
    },
    {
      "name": "SetFemaleIconPath",
      "description": " - sets the female icon texture"
    },
    {
      "name": "IsPlayable",
      "description": " - returns whether the specified object is playable or not. Returns true only if the object is of a type which can be flagged as playable in the editor."
    },
    {
      "name": "IsPlayable2",
      "description": " - returns whether the specified object is playable or not. If the object is of a type which cannot be flagged as playable in the editor, this function returns true."
    },
    {
      "name": "SetIsPlayable",
      "description": " - specifies whether the object can be used by the player"
    },
    {
      "name": "IsBipedIconPathValid",
      "description": " - returns 1 if the icon path for the object exists in the user's Data folder or within one of the BSA archives."
    },
    {
      "name": "IsBipedModelPathValid",
      "description": " - returns 1 if the model path for the object exists in the user's Data folder or within one of the BSA archives."
    },
    {
      "name": "GetBipedModelPath",
      "description": " - returns the file path of one of the models for the specified biped object."
    },
    {
      "name": "SetBipedModelPathEX",
      "description": " - sets the file path of the male or female model for the specified biped object."
    },
    {
      "name": "GetBipedIconPath",
      "description": " - returns the file path of one of the icons for the specified biped object."
    },
    {
      "name": "SetBipedIconPathEX",
      "description": " - sets the file path of the male or female icon for the specified biped object."
    },
    {
      "name": "GetHidesRings",
      "description": " - returns 1 if the \"hides rings\" flag is set for the biped object."
    },
    {
      "name": "GetHidesAmulet",
      "description": " - returns 1 if the \"hides amulet\" flag is set for the biped object."
    },
    {
      "name": "SetHidesRings",
      "description": " - modifies the \"hides rings\" flag."
    },
    {
      "name": "SetHidesAmulet",
      "description": " - modifies the \"hides amulet\" flag."
    },
    {
      "name": "GetBipedSlotMask",
      "description": " - returns the slots occupied by a biped object."
    },
    {
      "name": "SetBipedSlotMask",
      "description": " - sets the slots occupied by a biped object."
    },
    {
      "name": "GetNumDetectedActors",
      "description": " - returns the number of other actors of which the calling actor may detect. This includes actors detected at \"Lost\" or \"Unseen\" level."
    },
    {
      "name": "GetNthDetectedActor",
      "description": " - returns the Nth actor in the calling actor's detection list"
    },
    {
      "name": "SetDetectionState",
      "description": " - sets the "
    },
    {
      "name": "IsBlocking",
      "description": " - returns 1 if the calling actor is blocking"
    },
    {
      "name": "IsAttacking",
      "description": " - returns 1 if the calling actor is attacking"
    },
    {
      "name": "IsRecoiling",
      "description": " - returns 1 if the calling actor is recoiling"
    },
    {
      "name": "IsDodging",
      "description": " - returns 1 if the calling actor is dodging"
    },
    {
      "name": "IsStaggered",
      "description": " - returns 1 if the calling actor is staggered"
    },
    {
      "name": "IsMovingForward",
      "description": " - returns 1 if the calling actor is attempting to move forward, even if his path is blocked."
    },
    {
      "name": "IsMovingLeft",
      "description": " - returns 1 if the calling actor is attempting to strafe left"
    },
    {
      "name": "IsMovingRight",
      "description": " - returns 1 if the calling actor is attempting to strafe right"
    },
    {
      "name": "IsMovingBackward",
      "description": " - returns 1 if the calling actor is attempting to move backwards"
    },
    {
      "name": "IsTurningLeft",
      "description": " - returns 1 if the calling actor is turning left"
    },
    {
      "name": "IsTurningRight",
      "description": " - returns 1 if the calling actor is turning right"
    },
    {
      "name": "IsInAir",
      "description": " - returns 1 if the calling actor is airborne, whether jumping or falling"
    },
    {
      "name": "IsJumping",
      "description": " - returns 1 if the calling actor is beginning to jump (playing the JumpStart anim group)"
    },
    {
      "name": "IsOnGround",
      "description": " - returns 1 if the calling actor is on the ground"
    },
    {
      "name": "IsFlying",
      "description": " - returns 1 if the calling actor is flying. Only creatures can fly."
    },
    {
      "name": "IsPowerAttacking",
      "description": " - returns 1 if the calling actor is executing a power attack. See also the note on "
    },
    {
      "name": "IsCasting",
      "description": " - returns 1 if the calling actor is casting a spell"
    },
    {
      "name": "GetFallTimer",
      "description": " - returns the length of time for which the actor has been falling"
    },
    {
      "name": "IsAnimGroupPlaying",
      "description": " - returns 1 if the specified "
    },
    {
      "name": "AnimPathIncludes",
      "description": " - returns 1 if one of the calling actor's currently playing animation paths includes the specified substring"
    },
    {
      "name": "GetProcessLevel",
      "description": " - returns the actor's current process level, or -1 if called on a non-actor. Process level determines how frequently the game updates an actor's AI. In general, high process actors are in the same cell as the player, while more distant actors are kept at a lower process level."
    },
    {
      "name": "GetEquippedItems",
      "description": " - returns an array containing all items currently equipped by the calling actor"
    },
    {
      "name": "GetSpells",
      "description": " - returns an array containing all of the spells in an actor's spell list."
    },
    {
      "name": "GetActorAlpha",
      "description": " - actor references can be made more or less opaque or transparent by changing their alpha property via SetActorAlpha. This function returns the calling actor's current alpha as a floating point number between 0.0 and 1.0, with 0.0 corresponding to fully transparent and 1.0 to fully opaque."
    },
    {
      "name": "GetBaseActorValueC",
      "description": " - identical to the game's GetBaseAV command, but accepts an integer actor value code."
    },
    {
      "name": "GetBaseAV3",
      "description": " - returns the same value as the game's GetBaseAV command, but does not include the effects of Fortify abilities."
    },
    {
      "name": "GetBaseAV3C",
      "description": " - as GetBaseAV3, but takes an actor value code instead of an actor value name."
    },
    {
      "name": "GetAllies",
      "description": " -  for an actor in combat, returns an Array of other actors which the game considers allies of the calling actor at that particular moment."
    },
    {
      "name": "GetTargets",
      "description": " - for an actor in combat, returns an Array of actors which the game considers potential targets of the calling actor at that particular moment."
    },
    {
      "name": "GetSelectedSpells",
      "description": " - for an actor in combat, returns an Array containing zero to seven spells which the actor has selected from his full spell list (including spells resolved from leveled spell lists) for use. The list contains a maximum of one spell from each of the following categories: bound armor, bound weapon, \"buff\", melee, ranged, restorative, and summon spells."
    },
    {
      "name": "GetCombatSpells",
      "description": " - for an actor in combat, returns an Array of all the spells in the actor's spellbook, including spells resolved from leveled spells lists (which are resolved into actual spells when the actor enters combat). The actor will use a subset of these spells during combat; use GetSelectedSpells to determine which of these spells have been selected for use."
    },
    {
      "name": "PlayIdle",
      "description": " - attempts to make the calling actor play the specified idle animation. The animation must be one defined in the editor's Gameplay > Idle Animations window. Pass 1 for the forceIdle parameter to force the actor to play the idle regardless of any other animations currently playing."
    },
    {
      "name": "IsNaked",
      "description": " - returns 1 if the calling actor is naked, 0 otherwise. Naked means without a lowerbody equipment. If requireUpperbody is 1 it also requires an upperbody equipment."
    },
    {
      "name": "SetPackageTarget",
      "description": " - sets the target of the specified package. Target can be of several types, leading to several syntaxes for this command. The first listed usage sets the target to a specific reference. The second sets it to a particular base object with a specified quantity; when the package executes the actor will look for references to that base object to use as the target(s). The third usage sets the target to a "
    },
    {
      "name": "GetPackageData",
      "description": " - returns a stringmap containing info about a package. The returned stringmap contains the following keys:"
    },
    {
      "name": "GetPackageScheduleData",
      "description": " - returns a stringmap containing info about a package schedule. The returned stringmap contains the following keys:"
    },
    {
      "name": "GetPackageLocationData",
      "description": " - returns a stringmap containing info about a package location. The returned stringmap contains the following keys:"
    },
    {
      "name": "GetPackageTargetData",
      "description": " - returns a stringmap containing info about a package target. The returned stringmap contains the following keys:"
    },
    {
      "name": "SetPackageData",
      "description": " - sets the target, schedule, and/or location of a package. It accepts a stringmap consisting of one or more stringmaps with keys \"Location\", \"Target\", or \"Schedule\", each following the formats listed above. If any data is omitted, the existing package data will be retained."
    },
    {
      "name": "SetPackageTargetData",
      "description": " - sets the target of a package. Accepts a stringmap of the same format as that returned by "
    },
    {
      "name": "SetPackageLocationData",
      "description": " - sets the location of a package based on the passed stringmap of the same format as that returned by "
    },
    {
      "name": "SetPackageScheduleData",
      "description": " - sets the schedule of a package. Accepts a stringmap of the same format as that returned by "
    },
    {
      "name": "IsPoison",
      "description": " - returns whether the alchemy item is a poison."
    },
    {
      "name": "MatchPotion",
      "description": " - Oblivion keeps track of potions created by the player and reuses them if another potion is created with the same effects as one created previously. This command takes a potion and returns a previously-created potion bearing the same effects, if one exists. Note that in some cases it may return the same potion that was passed as the argument. Mainly useful during potion creation in the Alchemy menu, or when dynamically modifying potion effects via script."
    },
    {
      "name": "GetApparatusType",
      "description": " - returns the alchemy apparatus type of the calling reference or passed objectID"
    },
    {
      "name": "SetApparatusType",
      "description": " - sets the alchemy type of the calling reference or passed objectID"
    },
    {
      "name": "GetQuality",
      "description": " - returns the quality level of the calling reference or passed objectID"
    },
    {
      "name": "SetQuality",
      "description": " - sets the quality level of the calling reference or passed objectID"
    },
    {
      "name": "ModQuality",
      "description": " - modifies the quality of the calling reference or passed objectID"
    },
    {
      "name": "GetArmorAR",
      "description": " - returns the armor rating of the object"
    },
    {
      "name": "SetArmorAR",
      "description": " - sets the armor rating of the object"
    },
    {
      "name": "ModArmorAR",
      "description": " - modifies the armor rating of the object up or down"
    },
    {
      "name": "GetArmorType",
      "description": " - returns 0 if light armor and 1 if heavy armor"
    },
    {
      "name": "SetArmorType",
      "description": " - sets whether the armor is heavy or light"
    },
    {
      "name": "GetBirthsignSpells",
      "description": " - returns an Array containing the spells associated with the specified birthsign"
    },
    {
      "name": "GetBookCantBeTaken",
      "description": " - returns 1 if the book cannot be taken"
    },
    {
      "name": "GetBookIsScroll",
      "description": " - returns whether the book is a scroll or not"
    },
    {
      "name": "GetBookSkillTaught",
      "description": " - returns the skill taught by the book. If no skill is taught, returns -1."
    },
    {
      "name": "SetBookCantBeTaken",
      "description": " - sets whether the book can be taken"
    },
    {
      "name": "SetBookIsScroll",
      "description": " - sets whether the book is a scroll"
    },
    {
      "name": "SetBookSkillTaught",
      "description": " - sets the skill the book teaches. The the skillTaught value is not one of the skills, sets the value to 255."
    },
    {
      "name": "GetBookText",
      "description": " - returns the text of a book as a string. The result must be assigned to a string variable."
    },
    {
      "name": "GetBookLength",
      "description": " - returns the number of characters in a book's text."
    },
    {
      "name": "GetCellMusicType",
      "description": " - returns the music type of the player's current cell."
    },
    {
      "name": "SetCellMusicType",
      "description": " - sets the music type used in the specified cell."
    },
    {
      "name": "SetCellWaterHeight",
      "description": " - changes the water height of the specified cell. In order for the command to take full effect, the cell must be reloaded (con_PurgeCellBuffers can be used to forcibly unload it if it is still in memory). If used to alter the water height in a loaded cell, the water shader will reflect the new height and actors will switch between swimming and walking animations appropriately. However, floating physics and the water surface will not be updated until the cell is reloaded. This command has no effect in exteriors or in cells which have no water."
    },
    {
      "name": "GetCellDetachTime",
      "description": " - returns the cell's detach time, described above."
    },
    {
      "name": "GetCellResetHours",
      "description": " - returns the number of hours which must pass in the game before the cell is reset."
    },
    {
      "name": "SetCellResetHours",
      "description": " - sets the number of hours which mustpass before the cell is reset. This value must be less than the game setting iHoursToRespawnCell. Using this function to modify the reset hours for the current cell, or for exterior cells, has no effect."
    },
    {
      "name": "GetCellBehavesAsExterior",
      "description": " - returns true if the \"behaves as exterior\" cell is checked for the specified interior cell."
    },
    {
      "name": "IsCellPublic",
      "description": " - returns 1 if the cell is marked as 'public'."
    },
    {
      "name": "SetCellIsPublic",
      "description": " - sets the 'public' flag for the cell."
    },
    {
      "name": "SetCellHasWater",
      "description": " - sets the flag indicating whether or not the interior cell has water. Only affects interior cells, and changes are not visible until the cell is reloaded. Has no effect if called while the player is inside the specified cell."
    },
    {
      "name": "SetCellBehavesAsExterior",
      "description": " - sets the 'behaves like exterior' flag for the interior cell. Has no effect if called while the player is inside the specified cell."
    },
    {
      "name": "GetCellClimate",
      "description": " - returns the climate for the specified cell. "
    },
    {
      "name": "SetCellClimate",
      "description": " - sets the climate for the specified cell."
    },
    {
      "name": "GetCellLighting",
      "description": " - returns a StringMap describing the lighting properties for the interior cell. The StringMap contains the following key-value pairs corresponding to the fields in the editor's Cell Lighting tab, where 'RGB Array' is a 3-element Array with values from 0-255 in the order {red, green, blue}: "
    },
    {
      "name": "SetCellLighting",
      "description": " - alters one or more of an interior cell's lighting fields, taking a StringMap of the same format as that returned by "
    },
    {
      "name": "GetTerrainHeight",
      "description": " - returns the height of the terrain mesh at the specified x and y coordinates within the current exterior worldspace. X and Y are worldspace coordinates (e.g. as returned by GetPos). If the coordinates are outside of any loaded cells, returns 0.0. Note that this command does not check for collision with surfaces other than terrain."
    },
    {
      "name": "IsOblivionInterior",
      "description": " - returns 1 if the \"Oblivion interior\" flag has been checked for the specified interior cell."
    },
    {
      "name": "IsOblivionWorld",
      "description": " - returns 1 if the \"Oblivion World\" flag has been checked for the specified world space."
    },
    {
      "name": "CanFastTravelFromWorld",
      "description": " - returns 1 if the player is allowed to fast-travel from the specified world space."
    },
    {
      "name": "SetCanFastTravelFromWorld",
      "description": " - sets whether the player can fast-travel from the specified world space."
    },
    {
      "name": "GetCellWaterType",
      "description": " - returns the Water used by the interior cell. Returns zero if the cell has no water, or if the cell uses the default water type."
    },
    {
      "name": "SetCellWaterType",
      "description": " - sets the Water used by the interior cell. Changes will not be visible until the cell is reloaded."
    },
    {
      "name": "GetCellNorthRotation",
      "description": " - returns the rotation on the Z axis of the north marker within the specified interior cell, if one is present. The game uses the north marker's Z rotation to determine what direction is considered \"north\". Rotation returned is in degrees and is 0.0 if no north marker is present in the specified cell."
    },
    {
      "name": "IsInvertFastTravel",
      "description": " - returns true if the cell has InvertFastTravel flag "
    },
    {
      "name": "SetInvertFastTravel",
      "description": " - sets the InvertFastTravel flag on the provided cell, reversing the behaviour for the cell type regarding fast travel, allowing travel from interiors."
    },
    {
      "name": "IsCantWait",
      "description": " - returns true if the cell has CantWait flag "
    },
    {
      "name": "SetCantWait",
      "description": " - sets the CantWait flag on the provided cell, preventing waiting (and sleeping) inside. The change isn't backed into the savegame"
    },
    {
      "name": "GetCurrentClimateID",
      "description": " - returns the refID of the current climate."
    },
    {
      "name": "GetClimateSunriseBegin",
      "description": " - returns the time sunrise begins specified as a number of 10 minute units since midnight."
    },
    {
      "name": "GetClimateSunriseEnd",
      "description": " - returns the time sunrise ends specified as a number of 10 minute units since midnight."
    },
    {
      "name": "GetClimateSunsetBegin",
      "description": " - returns the time sunset begins specified as a number of 10 minute units since midnight."
    },
    {
      "name": "GetClimateSunsetEnd",
      "description": " - returns the time sunset ends specified as a number of 10 minute units since midnight."
    },
    {
      "name": "GetClimateMoonPhaseLength",
      "description": " - returns the number of days in the phase of the moons. The total moon cycle length is 8 x PhaseLength according to the CS."
    },
    {
      "name": "GetClimateHasMasser",
      "description": " - returns 1 if the current climate shows the moon Masser."
    },
    {
      "name": "GetClimateHasSecunda",
      "description": " - returns 1 if the current climate shows the moon Secunda."
    },
    {
      "name": "RefreshCurrentClimate",
      "description": " - refreshes the climate info to reflect changes made by the SetClimateXXX functions."
    },
    {
      "name": "SetClimateSunriseBegin",
      "description": " - sets the time sunrise begins as a number of 10 minute units since midnight."
    },
    {
      "name": "SetClimateSunriseEnd",
      "description": " - sets the time sunrise ends as a number of 10 minute units since midnight,"
    },
    {
      "name": "SetClimateSunsetBegin",
      "description": " - sets the time sunset begins as a number of 10 minute units since midnight."
    },
    {
      "name": "SetClimateSunsetEnd",
      "description": " - sets the time sunset ends as a number of 10 minute units since midnight."
    },
    {
      "name": "SetClimateMoonPhaseLength",
      "description": " - sets the number of days in the phase of the moons"
    },
    {
      "name": "SetClimateHasMasser",
      "description": " - sets  whether the climate shows the moon Masser"
    },
    {
      "name": "SetClimateHasSecunda",
      "description": " - sets whether the climate shows the moon Secunda"
    },
    {
      "name": "GetClimateVolatility",
      "description": " - returns the volatility of the climate"
    },
    {
      "name": "SetClimateVolatility",
      "description": " - sets the volatility of the climate"
    },
    {
      "name": "IsCreature",
      "description": " - returns whether the reference or passed id is a creature"
    },
    {
      "name": "GetCreatureType",
      "description": " - returns the type of the creature (Undead, Humanoid, Daedrea etc)"
    },
    {
      "name": "SetCreatureType",
      "description": " - attempts to change the type of the creature."
    },
    {
      "name": "GetCreatureCombatSkill",
      "description": " - returns the combat skill for the creature"
    },
    {
      "name": "GetCreatureMagicSkill",
      "description": " - returns the magic skill for the creature"
    },
    {
      "name": "GetCreatureStealthSkill",
      "description": " - returns the stealth skill for the creature"
    },
    {
      "name": "SetCreatureSkill",
      "description": " - sets the value of one of the creature's skills. Pass \"stealth\", \"magic\", or \"combat\" as the skill name. The skill value must be between 0 and 255."
    },
    {
      "name": "GetCreatureReach",
      "description": " - returns the reach of the creature"
    },
    {
      "name": "GetCreatureSoulLevel",
      "description": " - returns the soul level of the creature"
    },
    {
      "name": "GetCreatureBaseScale",
      "description": " - retuns the base scale of the creature"
    },
    {
      "name": "GetCreatureWalks",
      "description": " - returns 1 if the Walks flag is set on the creature"
    },
    {
      "name": "GetCreatureSwims",
      "description": " - returns 1 if the Swims flag is set on the creature"
    },
    {
      "name": "GetCreatureFlies",
      "description": " - returns 1 if the Flies flag is set on the creature"
    },
    {
      "name": "IsCreatureBiped",
      "description": " - returns 1 if the Biped flag is set on the creature"
    },
    {
      "name": "CreatureHasNoMovement",
      "description": " - returns 1 if the No Movement flag is set on the creature"
    },
    {
      "name": "CreatureHasNoHead",
      "description": " - returns 1 if the No Head flag is set on the creature"
    },
    {
      "name": "CreatureHasNoLeftArm",
      "description": " - returns 1 if the No Left Arm flag is set on the creature."
    },
    {
      "name": "CreatureHasNoRightArm",
      "description": " - returns 1 if the No Right Arm flag is set on the creature."
    },
    {
      "name": "CreatureNoCombatInWater",
      "description": " - returns 1 if the No Combat In Water flag is set on the creature."
    },
    {
      "name": "CreatureUsesWeaponAndShield",
      "description": " - returns 1 if the Uses Weapon and Shield flag is set on the creature."
    },
    {
      "name": "GetRider",
      "description": " - returns the NPC currently riding the calling horse."
    },
    {
      "name": "GetCreatureSoundBase",
      "description": " - returns the creature from which the specified creature's sounds are derived, if any."
    },
    {
      "name": "SetCreatureSoundBase",
      "description": " - sets the creature from which the creature inherits its sounds. The inheriting creature must not itself be a sound base (mustn't define its own sounds), and the creature specified as the sound base must be a sound base (defining its own sounds) or null."
    },
    {
      "name": "GetCreatureSound",
      "description": " - returns the creature's sound associated with the specified action."
    },
    {
      "name": "HasModel",
      "description": " - returns 1 if the creature's model list includes the specified .nif file. The file must appear in the creature's meshes folder. String must include the \".nif\" extension and is case-insensitive."
    },
    {
      "name": "ToggleCreatureModel",
      "description": " - toggles a model within a creature's model list on or off. The model path must be relative to the creature's model folder and include the \".nif\" extension. When called on a reference which is currently being rendered, the reference must be disabled and then enabled before the change is visible."
    },
    {
      "name": "GetCreatureModelPaths",
      "description": " - returns an Array containing the set of model paths in the creature's model list. Only those models which are toggled on are included."
    },
    {
      "name": "GetCombatStyle",
      "description": " - returns the combat style assigned to the calling reference."
    },
    {
      "name": "IsLoadDoor",
      "description": " - returns 1 if the calling reference is a load door"
    },
    {
      "name": "GetLinkedDoor",
      "description": " - returns the door to which the calling load door is linked"
    },
    {
      "name": "GetTeleportCell",
      "description": " - returns the cell to which the calling load door teleports"
    },
    {
      "name": "IsOblivionGate",
      "description": " -returns true if the door is flagged as an Oblivion gate in the editor."
    },
    {
      "name": "IsHiddenDoor",
      "description": " - returns 1 if the \"hidden\" flag is set for the door."
    },
    {
      "name": "IsAutomaticDoor",
      "description": " - returns 1 if the \"Automatic\" flag is set for the door."
    },
    {
      "name": "IsMinimalUseDoor",
      "description": " - returns 1 if the \"Minimal Use\" flag is set for the door."
    },
    {
      "name": "SetIsHiddenDoor",
      "description": " - sets or clears the \"hidden\" flag for the door."
    },
    {
      "name": "SetIsAutomaticDoor",
      "description": " - sets or clears the \"Automatic\" flag for the door."
    },
    {
      "name": "SetIsMinimalUseDoor",
      "description": " - sets or clears the \"Minimal Use\" flag for the door."
    },
    {
      "name": "SetIsOblivionGate",
      "description": " - sets or clears the \"Oblivion Gate\" flag for the door."
    },
    {
      "name": "SetDoorTeleport",
      "description": " - sets the reference, coordinates, and rotation to which the calling door teleports. Only the reference argument is required; the values for the others will be taken from the specified reference's coordinates and rotation if omitted. The bTemporary argument specifies that the change should not be saved in the savegame; by default, or if the argument is zero, the change will be saved."
    },
    {
      "name": "LinkToDoor",
      "description": " - links the calling door reference to the specified door reference. This causes each of the doors to teleport to the other when activated. Both doors must be persistent references and neither can already be linked to another door. Actors will use the doors in their pathfinding. The change persists in the savegame."
    },
    {
      "name": "GetDoorTeleportX",
      "description": " - returns the x coordinate to which the calling door teleports."
    },
    {
      "name": "GetDoorTeleportY",
      "description": " - returns the y coordinate to which the calling door teleports."
    },
    {
      "name": "GetDoorTeleportZ",
      "description": " - returns the z coordinate to which the calling door teleports."
    },
    {
      "name": "GetDoorTeleportRot",
      "description": " - returns the rotation to which the calling door teleports. This is the angle the player will be facing after activatingthe load door."
    },
    {
      "name": "GetTeleportCellName",
      "description": " - when called on a teleporting door reference, returns the name of the cell or worldspace to which the door teleports"
    },
    {
      "name": "GetEnchantmentType",
      "description": " - returns the type of the enchantment"
    },
    {
      "name": "SetEnchantmentType",
      "description": " - sets the type of the enchantment"
    },
    {
      "name": "GetEnchantmentCharge",
      "description": " - returns the charge of the enchantment. Of unknown and dubious use."
    },
    {
      "name": "SetEnchantmentCharge",
      "description": " - sets the charge of the enchantment. Of unknown and dubious use."
    },
    {
      "name": "ModEnchantmentCharge",
      "description": " - modifies the charge of the enchantment. Of unknown and dubious use."
    },
    {
      "name": "GetEnchantmentCost",
      "description": " - returns the magicka charge cost for using the enchantment."
    },
    {
      "name": "SetEnchantmentCost",
      "description": " - sets the cost for using the enchantment."
    },
    {
      "name": "ModEnchantmentCost",
      "description": " - modifies the cost for using the enchantment up or down."
    },
    {
      "name": "FactionHasSpecialCombat",
      "description": " - returns 1 if the Special Combat flag is set on the faction"
    },
    {
      "name": "IsFactionEvil",
      "description": " - returns 1 if the faction is marked as evil."
    },
    {
      "name": "IsFactionHidden",
      "description": " - returns 1 if the faction is not shown on the player's faction sheet."
    },
    {
      "name": "SetFactionEvil",
      "description": " - changes the Evil flag on the faction. Changes are saved in the savegame."
    },
    {
      "name": "SetFactionHidden",
      "description": " - changes the Hidden flag on the faction. Changes are saved in the savegame."
    },
    {
      "name": "SetFactionHasSpecialCombat",
      "description": " - changes the Special Combat flag on the faction. Changes are saved in the savegame."
    },
    {
      "name": "GetNumRanks",
      "description": " - returns the number of ranks in the faction."
    },
    {
      "name": "GetNthFactionRankName",
      "description": " - returns the title of the nth rank in a faction. Optionally returns the female rank name."
    },
    {
      "name": "SetNthFactionRankNameEX",
      "description": " - sets the title of the nth rank in a faction. Optionally sets the female rank name."
    },
    {
      "name": "IsHarvested",
      "description": " - returns 1 if the calling reference's ingredient has been harvested."
    },
    {
      "name": "SetHarvested",
      "description": " - mark or unmark the calling reference as having been harvested. Changes are saved in the savegame."
    },
    {
      "name": "GetIngredient",
      "description": " - returns the ingredient contained in a plant."
    },
    {
      "name": "SetIngredient",
      "description": " - sets the ingredient contained in a plant. Omit the ingredient parameter or pass an empty ref variable to set it to \"no ingredient.\""
    },
    {
      "name": "GetIngredientChance",
      "description": " - returns the % chance of harvesting an ingredient from the plant for a specific season where 0 = spring, 1 = summer, 2 = autumn, and 3 = winter. Return value ranges from 0 to 100."
    },
    {
      "name": "SetIngredientChance",
      "description": " - sets the %chance of harvesting an ingredient based on the specified season."
    },
    {
      "name": "AddToLeveledList",
      "description": " - adds an object to a leveled creature, spell, or item list. "
    },
    {
      "name": "RemoveFromLeveledList",
      "description": " - removes all occurences of an object from a leveled list and returns the number of occurences removed."
    },
    {
      "name": "CalcLeveledItem",
      "description": " - returns one item from a leveled item list, selected randomly for a character of the specified level."
    },
    {
      "name": "CalcLevItemNR",
      "description": " - does the same thing as CalcLeveledItem but will not recurse through nested leveled lists. This means that unlike CalcLeveledItem, CalcLevItemNR can return another leveled list rather than a real object."
    },
    {
      "name": "CalcLevItems",
      "description": " - returns an Array of StringMaps representing items selected randomly from a leveled item list. This command uses the game code to select items, which means the items returned are the same as those the game would select for an actor of the specified level. Each entry in the returned Array is a StringMap with the key-value pairs: \"item\":item (form) and \"count\":count (integer). The optional \"count\" parameter is 1 by default."
    },
    {
      "name": "GetCalcAllLevels",
      "description": " - returns 1 if the \"calculate for all levels <= PC level\" flag is checked."
    },
    {
      "name": "SetCalcAllLevels",
      "description": " - sets the \"calculate for all levels <= PC level\" flag on the leveled list."
    },
    {
      "name": "GetCalcEachInCount",
      "description": " - returns 1 if the \"calculate for each item in count\" flag is checked."
    },
    {
      "name": "GetChanceNone",
      "description": " - returns the chance from 0 to 100 that a leveled list returns no item."
    },
    {
      "name": "GetNthLevItem",
      "description": " - returns the Nth element in a leveled list, as ordered in the Construction Set."
    },
    {
      "name": "GetNthLevItemCount",
      "description": " - returns the count of the Nth element of a leveled list."
    },
    {
      "name": "GetNthLevItemLevel",
      "description": " - returns the level of the Nth element of a leveled list."
    },
    {
      "name": "GetNumLevItems",
      "description": " - returns the number of elements in a leveled list."
    },
    {
      "name": "GetLevItemByLevel",
      "description": " - returns the first element of the specified level in the leveled list."
    },
    {
      "name": "RemoveLevItemByLevel",
      "description": " - removes any elements of the specified level from a leveled list"
    },
    {
      "name": "ClearLeveledList",
      "description": " - removes all elements from a leveled list."
    },
    {
      "name": "RemoveNthLevItem",
      "description": " - removes the nth item from a leveled list."
    },
    {
      "name": "GetLevItemIndexByLevel",
      "description": " - returns the index of the first item of the specified level within a leveled list, or -1 if no item exists for that level."
    },
    {
      "name": "GetLevItemIndexByForm",
      "description": " - returns the index of the first occurrence of the specified form in a leveled list, or -1 if the form is not found."
    },
    {
      "name": "SetChanceNone",
      "description": " - sets the chance that a leveled list generates no item."
    },
    {
      "name": "GetLevCreatureTemplate",
      "description": " - gets the template actor of a leveled creature list."
    },
    {
      "name": "SetLevCreatureTemplate",
      "description": " - sets the template actor of a leveled creature. Omitting or passing a null ref as the second argument will remove any existing template."
    },
    {
      "name": "IsLightCarriable",
      "description": " - returns 1 if the light may be placed in an inventory."
    },
    {
      "name": "GetLightRadius",
      "description": " - returns the radius of the light."
    },
    {
      "name": "SetLightRadius",
      "description": " - sets the radius of the light. Changes are not saved in the savegame."
    },
    {
      "name": "GetLightRGB",
      "description": " - returns the red, green, and blue components of the light's color as an Array of 3 elements of values 0 through 255. The first element corresponds to the red value, the second to green, and the third to blue."
    },
    {
      "name": "SetLightRGB",
      "description": " - sets the red, green, and blue components of the light's color, accepting the components as an Array of 3 elements of values 0 through 255. The first element corresponds to the red value, the second to green, and the third to blue."
    },
    {
      "name": "GetLightDuration",
      "description": " - returns the duration of the light as defined in the editor."
    },
    {
      "name": "SetLightDuration",
      "description": " - sets the duration of the light."
    },
    {
      "name": "GetTimeLeft",
      "description": " - returns the amount of time left before the calling light reference expires."
    },
    {
      "name": "GetEquippedTorchTimeLeft",
      "description": " - returns the amount of time before the torch equipped by the calling actor expires."
    },
    {
      "name": "SetTimeLeft",
      "description": " - sets the amount of time before the calling light reference expires. "
    },
    {
      "name": "GetMagicEffectCode",
      "description": " - returns the magic effect code of the effect."
    },
    {
      "name": "GetMagicEffectChars",
      "description": " - returns the 4-character code for a magic effect"
    },
    {
      "name": "GetMagicEffectCharsC",
      "description": " - returns the 4-character code for a magic effect"
    },
    {
      "name": "MagicEffectFromCode",
      "description": " - given an effect code, returns the effect setting matching that code."
    },
    {
      "name": "MagicEffectFromChars",
      "description": " - given a string representing a four-letter effect code (e.g. \"REHE\"), returns the effect setting matching that code"
    },
    {
      "name": "MagicEffectCodeFromChars",
      "description": " - given a string representing a four-letter effect code (e.g. \"REHE\"), returns the effect code for the associated effect setting."
    },
    {
      "name": "GetMagicEffectBaseCost(C)",
      "description": " - returns the base cost of the magic effect"
    },
    {
      "name": "GetMagicEffectSchool(C)",
      "description": " - returns the controlling school of the magic effect"
    },
    {
      "name": "GetMagicEffectProjectileSpeed(C)",
      "description": " - returns the projectile speed of the magic effect"
    },
    {
      "name": "GetMagicEffectEnchantFactor(C)",
      "description": " - returns the constant effect enchantment factor of the magic effect"
    },
    {
      "name": "GetMagicEffectBarterFactor(C)",
      "description": " - returns the constant effect barter factor of the magic effect"
    },
    {
      "name": "IsMagicEffectHostile(C)",
      "description": " - returns whether the magic effect is hostile"
    },
    {
      "name": "IsMagicEffectForSpellmaking(C)",
      "description": " - returns whether the magic effect can be used for spell making"
    },
    {
      "name": "IsMagicEffectForEnchanting(C)",
      "description": " - returns whether the magic effect can be used when enchanting"
    },
    {
      "name": "IsMagicEffectDetrimental(C)",
      "description": " - returns whether the magic effect harms the receipient"
    },
    {
      "name": "IsMagicEffectCanRecover(C)",
      "description": " - returns whether the target can recover from the effect"
    },
    {
      "name": "IsMagicEffectMagnitudePercent(C)",
      "description": " - returns whether the magic effect's magnitude is a percentage"
    },
    {
      "name": "MagicEffectFXPersists(C)",
      "description": " - returns whether the magic effect's graphics effects persist"
    },
    {
      "name": "IsMagicEffectOnSelfAllowed(C)",
      "description": " - returns whether the magic effect can be cast on self"
    },
    {
      "name": "IsMagicEffectOnTouchAllowed(C)",
      "description": " - returns whether the magic effect can be cast on touch"
    },
    {
      "name": "IsMagicEffectOnTargetAllowed(C)",
      "description": " - returns whether the magic effect can be cast on target"
    },
    {
      "name": "MagicEffectHasNoDuration(C)",
      "description": " - returns whether the magic effect doesn't use the duration value"
    },
    {
      "name": "MagicEffectHasNoMagnitude(C)",
      "description": " - returns whether the magic effect doesn't use the magnitude value"
    },
    {
      "name": "MagicEffectHasNoArea(C)",
      "description": " - returns whether the magic effect doesn't use the area value"
    },
    {
      "name": "MagicEffectHasNoIngredient(C)",
      "description": " - returns whether the magic effect has no ingredient"
    },
    {
      "name": "MagicEffectHasNoHitEffect(C)",
      "description": " - returns whether the magic effect has a graphic effect when it hits"
    },
    {
      "name": "MagicEffectUsesWeapon(C)",
      "description": " - returns whether the magic effect summons a weapon"
    },
    {
      "name": "MagicEffectUsesArmor(C)",
      "description": " - returns whether the magic effect summons armor"
    },
    {
      "name": "MagicEffectUsesCreature(C)",
      "description": " - returns whether the magic effect summons a creature"
    },
    {
      "name": "MagicEffectUsesSkill(C)",
      "description": " - returns whether the magic effect affects a skill"
    },
    {
      "name": "MagicEffectUsesAttribute(C)",
      "description": " - returns whether the magic effect affects an attribute"
    },
    {
      "name": "MagicEffectUsesOtherActorValue(C)",
      "description": " - returns whether the magic effect affects an actor value that is not a skill or an attribute"
    },
    {
      "name": "GetMagicEffectOtherActorValue(C)",
      "description": " - returns the actor value (skill, attribute or other) affected by the magic effect"
    },
    {
      "name": "GetMagicEffectUsedObject(C)",
      "description": " - returns the weapon, armor or creature summoned by the magic effect"
    },
    {
      "name": "RemoveNthMagicEffectCounter(C)",
      "description": " - removes the "
    },
    {
      "name": "AddMagicEffectCounter(C)",
      "description": " - adds a counter-effect to the magic effect. The 'C' version accepts magic effect codes for both arguments."
    },
    {
      "name": "GetMagicEffectCounters(C)",
      "description": " - returns an Array containing the effect codes of all counter-effects for the specified magic effect."
    },
    {
      "name": "SetMagicEffectCounters(C)",
      "description": " - accepts an Array of effect codes and assigns those effects as counter-effects for the specified magic effect, overriding any existing counter-effects. The user must guarantee that the passed array contains valid effect codes and nothing else. The function returns 1 if the new counter-effects were successfully applied, 0 otherwise."
    },
    {
      "name": "IsMapMarkerVisible",
      "description": " - returns 1 if the map marker can be seen on the player's map"
    },
    {
      "name": "SetMapMarkerVisible",
      "description": " - sets whether the map marker can be seen on the player's map"
    },
    {
      "name": "CanTravelToMapMarker",
      "description": " - returns 1 if the player can travel to the map marker by clicking on it in the map menu"
    },
    {
      "name": "SetCanTravelToMapMarker",
      "description": " - sets whether the player can travel to the map marker by clicking it in the map menu"
    },
    {
      "name": "GetMapMarkerType",
      "description": " - returns the type of icon used to represent the location on the map."
    },
    {
      "name": "SetMapMarkerType",
      "description": " - sets the type of icon used to represent the location on the map."
    },
    {
      "name": "GetMapMarkers",
      "description": " - returns an Array containing all map marker references. The filter argument can be used to filter out markers based on their visibility and accessibility: pass 0 to include only visible markers which can be fast-traveled to, 1 to include all visible markers, and 2 to include all markers, including those which are not visible. The default filter value is 1. Pass a "
    },
    {
      "name": "GetEquippedObject",
      "description": " - returns the base object of the item equipped in the specified slot"
    },
    {
      "name": "GetEquipmentSlotMask",
      "description": " - Returns the base object of the first equipped object to match the specified equipment slot mask. If no 'value' parameter is specified, it is assumed to be the same value as the 'mask' parameter. For example, an object taking up the UpperBody, LowerBody, and Foot slots would have a mask of 4 + 8 + 32 = 44. See the \""
    },
    {
      "name": "GetMerchantContainer",
      "description": " - returns the reference to the NPC's merchant container"
    },
    {
      "name": "SetMerchantContainer",
      "description": " - replaces the specified mechant's container and returns the old container. "
    },
    {
      "name": "GetHorse",
      "description": " - returns the horse currently ridden by the calling NPC."
    },
    {
      "name": "GetTravelHorse",
      "description": " - returns a reference to the travel horse used by the calling reference."
    },
    {
      "name": "SetTravelHorse",
      "description": " - Sets the travel horse used by the calling reference to the horse reference specified. Changes are not saved in the savegame."
    },
    {
      "name": "IsFemale",
      "description": " - returns 1 if the NPC is female."
    },
    {
      "name": "CopyHair",
      "description": " - Copies the hair style, length, and color from one NPC to another. Changes alter the base actor and are not saved in the savegame unless called on the player."
    },
    {
      "name": "CopyEyes",
      "description": " - Copies the eyes used by one npc onto another, with the same caveats as CopyHair."
    },
    {
      "name": "SetHair",
      "description": " - Sets the hair on the NPC to a hairstyle predefined in the CS, with the same caveats as CopyHair."
    },
    {
      "name": "SetEyes",
      "description": " - Sets the eyes on the NPC to a set of eyes predefined in the CS, with the same caveats as CopyHair."
    },
    {
      "name": "GetRace",
      "description": " - returns the race of an NPC."
    },
    {
      "name": "CopyRace",
      "description": " - modifies the calling NPC reference to be the same race as the passed base NPC. The calling NPC gets the same skeleton, textures, and other race attributes of the specified base NPC. Its facial parameters, hair, and eyes do not change. This command affects the base object of the calling NPC, and should only be used on references which are unique (no other references share the same base form). Note that if the NPC's new race uses a different voice than its old voice, it may not audibly speak any race-specific dialog which has not been recorded for the new voice."
    },
    {
      "name": "GetHair",
      "description": " - returns the NPC's hairstyle."
    },
    {
      "name": "GetEyes",
      "description": " - returns the NPC's eyes."
    },
    {
      "name": "GetHairColor",
      "description": " - returns the RGB value of the NPC's hair color."
    },
    {
      "name": "GetTrainerLevel",
      "description": " - returns the level at which the NPC offers training."
    },
    {
      "name": "GetTrainerSkill",
      "description": " - returns the skill in which the NPC offers training as an "
    },
    {
      "name": "SetTrainerLevel",
      "description": " - sets the level at which an NPC offers training."
    },
    {
      "name": "SetTrainerSkill",
      "description": " - sets the skill in which an NPC offers training."
    },
    {
      "name": "GetServicesMask",
      "description": " - returns an integer code representing the services offered by an NPC. The code is obtained by ORing (adding) "
    },
    {
      "name": "OffersServicesC",
      "description": " - returns 1 if the NPC offers all of the services specified by the services mask"
    },
    {
      "name": "SetOffersServicesC",
      "description": " - sets the services offered by the NPC to the specified services mask."
    },
    {
      "name": "GetPathNodesInRadius",
      "description": " - returns an Array of all path nodes located within the circular area described by the center point (x, y) and the radius. By default, disabled nodes are ignored; pass 1 for the optional fourth argument to include them."
    },
    {
      "name": "GetPathNodesInRect",
      "description": " - returns an Array of all path nodes located within the rectangular area described by the center point (x, y) and the extents along the x and y axes (i.e. half-width and half-height). An angle of rotation in radians can optionally be specified; if omitted the rectangle is assumed to be aligned with the world axes. By default, disabled nodes are ignored; pass 1 for the optional sixth argument to include them."
    },
    {
      "name": "GetPathNodePos",
      "description": " - returns the x, y, or z coordinate of the specified path node. "
    },
    {
      "name": "IsPathNodeDisabled",
      "description": " - returns 1 if the path node is disabled."
    },
    {
      "name": "SetPathNodeDisabled",
      "description": " - enables or disables the specified path node. This node will no longer be used in future pathfinding attempts, but actors who have already built a path including this node may continue along it normally. If this is undesirable, calling EvaluatePackage on the actor will force it to build a new path."
    },
    {
      "name": "GetPathNodeLinkedRef",
      "description": " - returns the persistent reference linked to this node in the editor, if any."
    },
    {
      "name": "PathEdgeExists",
      "description": " - returns 1 if the two nodes are connected."
    },
    {
      "name": "GetCrosshairRef",
      "description": " - returns a reference to whatever is currently under the player's crosshair. Generally returns zero when called during MenuMode. Note that this function will return non-activatable references as well; use "
    },
    {
      "name": "GetPlayersLastRiddenHorse",
      "description": " - returns a reference to the horse most recently ridden by the player."
    },
    {
      "name": "SetPlayersLastRiddenHorse",
      "description": " - marks the specified horse as the horse most recently ridden by the player. This is the horse that will accompany the player when fast traveling while dismounted. The argument must be a Creature of type Horse. Additionally, in order for the new horse to fast travel with the player it must not be owned by anyone other than the player."
    },
    {
      "name": "ClearPlayersLastRiddenHorse",
      "description": " - clears the game's memory of the horse last ridden by the player. This prevents any horse from accompanying the player when fast traveling, provided the player is not mounted on a horse when he travels."
    },
    {
      "name": "GetPlayersLastActivatedLoadDoor",
      "description": " - returns a reference to the load door most recently activated by the player."
    },
    {
      "name": "GetGodMode",
      "description": " - returns 1 if the player has toggled god mode on."
    },
    {
      "name": "SetPCAMurderer",
      "description": " - sets whether the PC is a murderer or not."
    },
    {
      "name": "GetPlayerSpell",
      "description": " - returns the objectID of the player's current spell."
    },
    {
      "name": "GetPlayerSpellCount",
      "description": " - returns the player spell count."
    },
    {
      "name": "GetNthPlayerSpell",
      "description": " - returns the nth player spell. whichSpell is an index that starts at 0 for the first spell in the list."
    },
    {
      "name": "GetPCMajorSkillUps",
      "description": " - returns the number of major skill advancements toward the player's next level."
    },
    {
      "name": "SetPCMajorSkillUps",
      "description": " - sets the number of major skill advancements toward the player's next level"
    },
    {
      "name": "GetPCAttributeBonus",
      "description": " - returns the number of skill advancements contributing to the specified attribute's bonus for the next level. Note that game setting multipliers applied to these values determine the actual bonus at level-up. Returns -1 if passed an invalid actor value, including Luck."
    },
    {
      "name": "SetPCAttributeBonus",
      "description": " - sets the number of skill advancements contributing to the specified attribute's bonus for the next level. Note that game setting multipliers applied to these values determine the actual bonus at level-up. Does not affect Luck bonus."
    },
    {
      "name": "GetTotalPCAttributeBonus",
      "description": " - returns the sum of the player's attribute bonuses."
    },
    {
      "name": "ModPCSpellEffectiveness",
      "description": " - alters the script modifier applied to the player's spell effectiveness. This works similarly to Oblivion's ModAV command. Positive values increases the modifier, negative values decrease it. Any game calculations involving player spell effectiveness will use the modified value (base effectiveness + modifier). By default, the effects of this command persist until the end of the current game session. Pass 1 for the second parameter to save the amount modified in the savegame; it will then be applied every time the savegame is reloaded, and removed when reloading a different savegame."
    },
    {
      "name": "GetPCSpellEffectivenessModifier",
      "description": " - returns the current value of the script modifier for player spell effectiveness. Subtract this value from the return value of Player.GetSpellEffectiveness to get the player's base spell effectiveness."
    },
    {
      "name": "GetPCTrainingSessionsUsed",
      "description": " - returns the number of times the player has trained during his current level."
    },
    {
      "name": "SetPCTrainingSessionsUsed",
      "description": " - sets the number of times the player has trained during his current level."
    },
    {
      "name": "ModPCMovementSpeed",
      "description": " - applies a positive or negative modifier to the player's speed attribute as used in calculating his movement speed while swimming, walking, or running. The actual attribute is not modified, but movement calculations use the attribute value plus the modifier. Positive modifiers well above the maximum value of the speed attribute are permitted and effective; minimum speed including the modifier is limited to zero. By default, the effects of this command persist until the end of the current game session. Pass 1 for the second parameter to save the amount modified in the savegame; it will then be applied every time the savegame is reloaded, and removed when reloading a different savegame."
    },
    {
      "name": " ",
      "description": "GetPCMovementSpeedModifier"
    },
    {
      "name": "GetPlayerBirthsign",
      "description": " - returns the birthsign chosen by the player."
    },
    {
      "name": "SetPlayerBirthsign",
      "description": " - changes the player's birthsign to the one specified. This removes all effects of the previous birthsign and applies the effects of the new one."
    },
    {
      "name": "GetTelekinesisRef",
      "description": " - returns a reference to the object being manipulated by the player through telekinesis, if any."
    },
    {
      "name": "GetCurrentRegions",
      "description": " - returns an Array of all the regions in which the player is currently located, if any. In interior cells generally returns 0. Regions in exterior cells can overlap, therefore it's possible for the player to be in several regions simultaneously."
    },
    {
      "name": "GetPCLastDroppedItem",
      "description": " - returns the base object of the item most recently dropped by the player."
    },
    {
      "name": "GetPCLastDroppedItemRef",
      "description": " - returns the reference of the item most recently dropped by the player."
    },
    {
      "name": "GetPCAttributeBonusC",
      "description": " - returns the level-up bonus for the specified attribute."
    },
    {
      "name": "SetPCAttributeBonusC",
      "description": " - sets the level-up bonus for the specified attribute."
    },
    {
      "name": "GetLastUsedSigilStone",
      "description": " - returns the sigil stone most recently used to enchant an item during the current game session."
    },
    {
      "name": "GetLastSigilStoneEnchantedItem",
      "description": " - returns the unenchanted item most recently enchanted with a sigil stone during the current game session."
    },
    {
      "name": "GetLastSigilStoneCreatedItem",
      "description": " - returns the enchanted item most recently created with a sigil stone during the current game session."
    },
    {
      "name": "SetFlyCameraSpeedMult",
      "description": " - changes the speed multiplier for the player's camera when in fly camera mode."
    },
    {
      "name": "SetPlayerSkeletonPath",
      "description": " - Set the specific path as the player's skeleton."
    },
    {
      "name": "GetProjectileType",
      "description": " - returns the type of the projectile."
    },
    {
      "name": "GetProjectileSource",
      "description": " - returns the caster of a magic projectile or the archer who fired an arrow projectile."
    },
    {
      "name": "GetMagicProjectileSpell",
      "description": " - returns the spell attached to a magic projectile."
    },
    {
      "name": "SetMagicProjectileSpell",
      "description": " - changes the spell attached to a magic projectile."
    },
    {
      "name": "GetArrowProjectileEnchantment",
      "description": " - returns the enchantment on an arrow projectile."
    },
    {
      "name": "GetArrowProjectileBowEnchantment",
      "description": " - returns the enchantment on an arrow derived from the bow from which it was fired."
    },
    {
      "name": "GetArrowProjectilePoison",
      "description": " - returns the poison on an arrow projectile."
    },
    {
      "name": "SetPlayerProjectile",
      "description": " - sets the player as the source of the projectile. Actors hit by the projectile will react as if the player had cast the spell or fired the arrow."
    },
    {
      "name": "SetProjectileSource",
      "description": " - sets the source of a projectile. If an actor other than the player is set as the source, the target of the projectile will not necessarily respond to the attack."
    },
    {
      "name": "SetArrowProjectileEnchantment",
      "description": " - sets the arrow enchantment associated with the calling projectile."
    },
    {
      "name": "SetArrowProjectileBowEnchantment",
      "description": " - sets the bow enchantment associated with the calling projectile."
    },
    {
      "name": "SetArrowProjectilePoison",
      "description": " - sets the poison on the calling projectile."
    },
    {
      "name": "GetProjectileSpeed",
      "description": " - returns the speed of the projectile."
    },
    {
      "name": "GetProjectileDistanceTraveled",
      "description": " - returns the total distance traveled by the calling projectile. Currently does not work for arrow projectiles."
    },
    {
      "name": "GetProjectileLifetime",
      "description": " - returns the number of seconds for which the calling projectile has existed."
    },
    {
      "name": "SetProjectileSpeed",
      "description": " - sets the speed of the projectile. Note that other factors affect the movement of a projectile so a speed of zero does not necessarily completely halt the projectile."
    },
    {
      "name": "GetProjectile",
      "description": " - returns the projectile most recently fired by the calling actor. Optionally specify the type (1 for arrows, 2 for magic, 0 for either) and the arrow, spell, or staff enchantment to match. The minLifetime parameter specifies how old (in seconds) a projectile can be before it is ignored."
    },
    {
      "name": "SetActiveQuest",
      "description": " - sets the players active quest."
    },
    {
      "name": "GetActiveQuest",
      "description": " - returns the player's active quest, if any."
    },
    {
      "name": "ClearActiveQuest",
      "description": " - clears the player's active quest, if any."
    },
    {
      "name": "GetCurrentQuests",
      "description": " - returns a list of all currently active (uncompleted) quests. Note that this list includes quests which do not appear in the journal."
    },
    {
      "name": "GetCompletedQuests",
      "description": " - returns a list of all completed quests."
    },
    {
      "name": "IsQuestComplete",
      "description": " - returns 1 if the specified quest is marked as 'completed'."
    },
    {
      "name": "UncompleteQuest",
      "description": " - removes the 'completed' flag from the specified quest."
    },
    {
      "name": "QuestExists",
      "description": " - returns 1 if a quest exists with the specified editorID."
    },
    {
      "name": "GetStageIDs",
      "description": " - returns an Array containing the numeric index of each quest stage associated with the specified quest."
    },
    {
      "name": "GetStageEntries",
      "description": " - returns an Array of all of the entries associated with the specified quest stage. Each element of the array is a Stringmap containing the following fields: \"day\" (1-31), \"month\" (1-12), and \"year\", representing the date at which the entry was added to the player's journal, and \"text\" containing the log text for the entry. If the entry has not been added to the player's journal, the date fields will all be zero."
    },
    {
      "name": "SetStageText",
      "description": " - sets the log text associated with the specified quest stage entry for the specified quest. The change remains in effect for the duration of the game session or until undone with UnsetStageText."
    },
    {
      "name": "UnsetStageText",
      "description": " - reverses any modification made to the specified log entry text using SetStageText."
    },
    {
      "name": "SetStageDate",
      "description": " - for a quest stage entry which has already been added to the player's journal, modifies the date at which the entry was added. Specify the day of the month (1-31), month (1-12), and year."
    },
    {
      "name": "GetParentCell",
      "description": " - returns the objectID of the parent cell of the calling reference."
    },
    {
      "name": "GetParentWorldspace",
      "description": " - returns the worldspace to which the calling reference's cell belongs, if any. In interior cells this generally returns 0."
    },
    {
      "name": "ParentCellHasWater",
      "description": " - returns 1 if the reference's parent cell can contain water."
    },
    {
      "name": "GetParentCellWaterHeight",
      "description": " - returns the water height of the references parent cell."
    },
    {
      "name": "IsActivatable",
      "description": " - returns 1 if the calling reference can be activated under normal circumstances."
    },
    {
      "name": "IsUnderWater",
      "description": " - returns 1 if the calling reference's Z position is less than 120 units under its parent cell's water height."
    },
    {
      "name": "GetNumChildRefs",
      "description": " - returns the number of reference for which the calling reference behaves as an enable-state parent."
    },
    {
      "name": "GetNthChildRef",
      "description": " - returns the nth child reference associated with the calling reference. Child references are stored in no particular order."
    },
    {
      "name": "GetNumFollowers",
      "description": " - returns the number of actors currently following the calling actor. Summoned creatures are excluded."
    },
    {
      "name": "GetNthFollower",
      "description": " - returns a reference to the nth actor currently following the calling actor. Does not include summoned creatures."
    },
    {
      "name": "GetFollowers",
      "description": " - returns an array containing all actors currently following the calling actor, including summoned creatures."
    },
    {
      "name": "IsPersistent",
      "description": " - returns 1 if the calling reference is a persistent reference."
    },
    {
      "name": "SetScaleEX",
      "description": " - sets the scale of the calling reference. Unlike SetScale, the scale is not limited to a certain range. The reference should be disabled and then enabled after calling this function in order to update its scale and collision properties. The new scale is saved in the savegame."
    },
    {
      "name": "HasBeenPickedUp",
      "description": " - returns true if the calling reference is currently inactive due to having been picked up by an actor or otherwise transferred to an inventory"
    },
    {
      "name": "SetHasBeenPickedUp",
      "description": " - toggles the flag that marks a reference as having been picked up by an actor. When called on a reference which was previously picked up, causes the reference to \"respawn\". Use "
    },
    {
      "name": "GetRefCount",
      "description": " - returns the number of items in a stack of items in the world."
    },
    {
      "name": "SetRefCount",
      "description": " - sets the number of items in a stack of items in the world."
    },
    {
      "name": "SetBaseForm",
      "description": " - changes the base object associated with a reference, with the limitation that the new base form must be of the same type as the old one (i.e. you can swap a weapon reference's base form only with another weapon). Does not work on actors or on items in containers. Use "
    },
    {
      "name": "Activate2",
      "description": " - like the existing Activate command, causes a reference to be activated. The only difference is that this command circumvents the limit on recursive scripted activations of an object, allowing unlimited repeated processing of the target's OnActivate script block. Use with care as performance may degrade if a large number of calls to this command occur within a single frame."
    },
    {
      "name": "IsRefDeleted",
      "description": " - returns 1 if the passed object reference has been marked as deleted by a mod or the game. Deleted references should not be used in scripts."
    },
    {
      "name": "DeleteReference",
      "description": " - attempts to delete the calling object from the game and returns true if successful. In order for a reference to be deleted, it must:"
    },
    {
      "name": "GetBoundingBox",
      "description": " - returns a stringmap representing the calling objects axis-aligned bounding box. This command only works for mobile objects (projectiles and actors). The stringmap returned contains two stringmaps: \"center\" has keys \"x\", \"y\", and \"z\" representing the coordinates of the center of the bounding box, and \"extent\" has the same keys representing the extent of the box along each axis. For example, the height of the box is equal to GetBoundingBox->extent->z * 2. Similarly the bottom of the box is equal to GetBoundingBox->center->z - GetBoundingBox->extent->z"
    },
    {
      "name": "GetBoundingRadius",
      "description": " - returns the radius of a sphere large enough to entirely contain the 3D geometry of the calling object."
    },
    {
      "name": "Update3D",
      "description": " - updates the visual representation of the calling actor or object reference. This can be called immediately after commands like SetModelPath and SetEyes to make the changes visible and should work in any instance where instructions tell you to "
    },
    {
      "name": "HasEffectShader",
      "description": " - checks if the specified effect shader is playing on the calling reference, and if so returns the number of instances of that shader playing on it. Otherwise returns zero. Note that this command may return true for a short period after calling StopMagicShaderVisuals because the shader is not fully removed until its ending sequence has played out."
    },
    {
      "name": "IsInOblivion",
      "description": " - returns 1 if the calling reference is in a cell or worldspace marked as belonging to the realm of Oblivion."
    },
    {
      "name": "GetSigilStoneUses",
      "description": " - returns the number of uses for a sigil stone."
    },
    {
      "name": "SetSigilStoneUses",
      "description": " - sets the number of uses for a sigil stone."
    },
    {
      "name": "ModSigilStoneUses",
      "description": " - mods the number of uses for a sigil stone."
    },
    {
      "name": "GetPlayerSkillUse",
      "description": " - returns the current experience towards the next level of the skill"
    },
    {
      "name": "GetPlayerSkillUseC",
      "description": " - alternatve version of GetPlayerSkillUse taking an actor value code for the skill"
    },
    {
      "name": "IncrementPlayerSkillUse",
      "description": " - records some additional uses of one of the skill actions"
    },
    {
      "name": "GetSkillUseIncrement",
      "description": " - gets the experience point increase for one use of a skill action"
    },
    {
      "name": "SetSkillUseIncrement",
      "description": " - sets the experience point increase for one use of a skill action"
    },
    {
      "name": "IncrementPlayerSkillUseC",
      "description": " - records some additional uses of one of the skill actions"
    },
    {
      "name": "TriggerPlayerSkillUse",
      "description": " - records positive or negative uses of one of the specified skill actions. Enough skill uses will increment or decrement the skill itself, and adjust the log of the number of increases for that skill."
    },
    {
      "name": "ModPlayerSkillExp",
      "description": " - directly adjusts the experience for a skill. A large enough adjustment will increment or decrement the skill itself, and adjust the log of the number of increase for that skill."
    },
    {
      "name": "GetSkillUseIncrementC",
      "description": " - gets the experience point increase for one use of a skill action"
    },
    {
      "name": "SetSkillUseIncrementC",
      "description": " - sets the experience point increase for one use of a skill action"
    },
    {
      "name": "GetSkillGoverningAttribute",
      "description": " - returns the governing attribute for the skill as an actor value code"
    },
    {
      "name": "SetSkillGoverningAttribute",
      "description": " - sets the governing attribute for the skill"
    },
    {
      "name": "GetSkillGoverningAttributeC",
      "description": " - alternate version of GetSkillGoverningAttribute taking an actor value code for the skill"
    },
    {
      "name": "SetSkillGoverningAttributeC",
      "description": " - alternate version of SetSkillGoverningAttribute taking actor value codes for the skill and attribute"
    },
    {
      "name": "GetPlayerSkillAdvances",
      "description": " - returns the number of times the skill level has advanced for that skill"
    },
    {
      "name": "SetPlayerSkillAdvances",
      "description": " - sets the number of times the skill has been advanced"
    },
    {
      "name": "GetRequiredSkillExp",
      "description": " - returns the total skill use required for the player to advance the specified skill. To get the "
    },
    {
      "name": "GetRequiredSkillExpC",
      "description": " - alternate version of GetRequiredSkillExp taking an actor value code for the skill."
    },
    {
      "name": "GetSkillSpecialization",
      "description": " - returns the skill's specialization as an integer. 0: Combat, 1: Magic, or 2: Stealth. "
    },
    {
      "name": "GetSkillSpecializationC",
      "description": " - alternate version of GetSkillSpecialization taking an actor value code for the skill."
    },
    {
      "name": "SetSkillSpecialization",
      "description": " - sets the skill's specialization as an integer. 0: Combat, 1: Magic, or 2: Stealth. "
    },
    {
      "name": "SetSkillSpecializationC",
      "description": " - alternate version of SetSkillSpecialization taking an actor value code for the skill"
    },
    {
      "name": "ToggleSkillPerk",
      "description": " - turns the perk associated with the specified skill at the specified mastery level on or off. Currently, this command only supports toggling the Journeyman Block perk. Support for additional perks and skills may be added in the future. The mastery level is an integer from 0 (Novice) to 4 (Master)."
    },
    {
      "name": "GetSoulLevel",
      "description": " - returns the soul level currently in the soul gem"
    },
    {
      "name": "GetSoulGemCapacity",
      "description": " - returns the max soul level the soul gem can contain"
    },
    {
      "name": "SetSoulLevel",
      "description": " - set the soul level of the soul gem"
    },
    {
      "name": "SetSoulGemCapacity",
      "description": " - set the capacity level of the soul gem"
    },
    {
      "name": "GetCurrentSoulLevel",
      "description": " - returns the current soul level of the calling actor reference"
    },
    {
      "name": "GetSoundAttenuation",
      "description": " - returns the specified attenuation value for the specified sound, where the attenuation is \"max\", \"min\", or \"static\""
    },
    {
      "name": "SetSoundAttenuation",
      "description": " - sets the specified attenuation value for the specified sound, where the attenuation is \"max\", \"min\", or \"static\""
    },
    {
      "name": "GetSpellType",
      "description": " - returns the spell type"
    },
    {
      "name": "SetSpellType",
      "description": " - sets the spell type"
    },
    {
      "name": "GetSpellMagickaCost",
      "description": " - returns the magicka casting cost according to the Oblivion formula. If called on a reference it will use the reference's magic skill values to determine the actual magicka cost of the spell. Without a reference it will return the base cost of the spell as reported in the CS."
    },
    {
      "name": "SetSpellMagickaCost",
      "description": " - sets the magicka casting cost"
    },
    {
      "name": "ModSpellMagickaCost",
      "description": " - modifies the magicka casting cost up or down"
    },
    {
      "name": "GetSpellMasteryLevel",
      "description": " - returns the mastery level of the spell"
    },
    {
      "name": "SetSpellMasteryLevel",
      "description": " - sets the mastery level of the spell"
    },
    {
      "name": "GetSpellSchool",
      "description": " - returns the school of the spell, determined by the most expensive effect item"
    },
    {
      "name": "GetSpellExplodesWithNoTarget",
      "description": " - returns whether the touch spell explodes without a target"
    },
    {
      "name": "SetSpellExplodesWithNoTarget",
      "description": " - sets whether the touch spell will explode without a target"
    },
    {
      "name": "IsSpellHostile",
      "description": " - returns 1 if the spell is considered hostile"
    },
    {
      "name": "SetSpellHostile",
      "description": " - toggles whether or not a spell is considered hostile"
    },
    {
      "name": "GetSpellPCStart",
      "description": " - returns true if the PC Start flag is set for the specified spell"
    },
    {
      "name": "GetSpellImmuneToSilence",
      "description": " - returns true if the Immune to Silence flag is set for the specified spell"
    },
    {
      "name": "GetSpellAreaEffectIgnoresLOS",
      "description": " - returns true if the AE Ignores LOS flag is set for the specified spell"
    },
    {
      "name": "GetSpellScriptEffectAlwaysApplies",
      "description": " - returns true if the SEFF Always Applies flag is set for the specified spell"
    },
    {
      "name": "GetSpellDisallowAbsorbReflect",
      "description": " - returns true if the Disallow Absorb Reflect flag is set for the specified spell"
    },
    {
      "name": "SetSpellPCStart",
      "description": " - sets the PC Start flag for the specified spell"
    },
    {
      "name": "SetSpellImmuneToSilence",
      "description": " - sets the Immune to Silence flag for the specified spell"
    },
    {
      "name": "SetSpellAreaEffectIgnoresLOS",
      "description": " - sets the AE Ignores LOS flag for the specified spell"
    },
    {
      "name": "SetSpellScriptEffectAlwaysApplies",
      "description": " - sets the SEFF Always Applies flag for the specified spell"
    },
    {
      "name": "SetSpellDisallowAbsorbReflect",
      "description": " - sets the Disallow Absorb Reflect flag for the specified spell"
    },
    {
      "name": "GetWeaponReach",
      "description": " - returns the reach of the weapon"
    },
    {
      "name": "SetWeaponReach",
      "description": " - sets the reach of the weapon"
    },
    {
      "name": "ModWeaponReach",
      "description": " - modifies the reach of the weapon up or down"
    },
    {
      "name": "GetWeaponType",
      "description": " - retuns the weapon type"
    },
    {
      "name": "SetWeaponType",
      "description": " - sets the weapon type"
    },
    {
      "name": "GetEquippedWeaponPoison",
      "description": " - returns the poison applied to the equipped weapon. Called on the weapon holder."
    },
    {
      "name": "SetEquippedWeaponPoison",
      "description": " - sets the poison applied to the equipped weapon and returns the previous poison.Called on the weapon holder."
    },
    {
      "name": "RemoveEquippedWeaponPoison",
      "description": " - removes and returns the poison applied to the equipped weapon. Called on the weapon holder."
    },
    {
      "name": "GetCurrentWeatherID",
      "description": " - returns the refID of the current weather"
    },
    {
      "name": "GetWeatherOverride",
      "description": " - returns the weather which is overriding the current weather as a result of the ForceWeather or SetWeather command with a non-zero \"override\" argument (for example, in the scripts which control weather near Oblivion gates), or zero if the weather is not being overridden. "
    },
    {
      "name": "GetWeatherWindSpeed",
      "description": " - returns the wind speed of the specified weather"
    },
    {
      "name": "SetWeatherWindSpeed",
      "description": " - sets the wind speed of the specified weather"
    },
    {
      "name": "GetWeatherCloudSpeedLower",
      "description": " - returns the speed of the lower cloud layer"
    },
    {
      "name": "SetWeatherCloudSpeedLower",
      "description": " - sets the speed of the lower cloud layer"
    },
    {
      "name": "GetWeatherCloudSpeedUpper",
      "description": " - returns the speed of the upper cloud layer"
    },
    {
      "name": "SetWeatherCloudSpeedUpper",
      "description": " - sets the speed of the upper cloud layer"
    },
    {
      "name": "GetWeatherTransDelta",
      "description": " - returns the transition delta of the weather"
    },
    {
      "name": "SetWeatherTransDelta",
      "description": " - sets the transition delta of the weather"
    },
    {
      "name": "GetWeatherSunGlare",
      "description": " - returns the sun glare"
    },
    {
      "name": "SetWeatherSunGlare",
      "description": " - sets the sun glare"
    },
    {
      "name": "GetWeatherSunDamage",
      "description": " - returns the sun damage"
    },
    {
      "name": "SetWeatherSunDamage",
      "description": " - sets the sun damage"
    },
    {
      "name": "GetWeatherFogDayNear",
      "description": " - returns the daytime near fog distance"
    },
    {
      "name": "SetWeatherFogDayNear",
      "description": " - sets the daytime near fog distance"
    },
    {
      "name": "GetWeatherFogDayFar",
      "description": " - returns the daytime far fog distance"
    },
    {
      "name": "SetWeatherFogDayFar",
      "description": "- sets the daytime far fog distance"
    },
    {
      "name": "GetWeatherFogNightNear",
      "description": " - returns the nighttime near fog distance"
    },
    {
      "name": "SetWeatherFogNightNear",
      "description": " - sets the nighttime near fog distance"
    },
    {
      "name": "GetWeatherFogNightFar",
      "description": " - returns the nighttime far fog distance"
    },
    {
      "name": "SetWeatherFogNightFar",
      "description": " - sets the nighttime far fog distance"
    },
    {
      "name": "GetWeatherHDRValue",
      "description": " - returns the specified HDR value for the weather"
    },
    {
      "name": "SetWeatherHDRValue",
      "description": " - sets the specified HDR value for the weather"
    },
    {
      "name": "GetWeatherColor",
      "description": " - returns the red, green or blue value of the specified weather color at the specified weather time"
    },
    {
      "name": "SetWeatherColor",
      "description": " - sets the red, green and blue values for the specified weather color at the specified weather time"
    },
    {
      "name": "GetWeatherLightningFrequency",
      "description": " - returns the frequency of the lightning"
    },
    {
      "name": "SetWeatherLightningFrequency",
      "description": " - sets the frequency of the lightning"
    },
    {
      "name": "GetWeatherClassification",
      "description": " - returns the precipitation "
    },
    {
      "name": "IsDoor",
      "description": " - returns whether the calling reference or passed objectID is a door"
    },
    {
      "name": "IsFurniture",
      "description": " - returns whether the calling reference or passed objectID is furniture"
    },
    {
      "name": "IsActivator",
      "description": " - returns whether the calling reference or passed objectID is an activator"
    },
    {
      "name": "GetGameLoaded",
      "description": " - returns 1 if a saved game was loaded or a new game was started since the last time this call was made. This command returns true once per game load/start for each script that uses it."
    },
    {
      "name": "GetGameRestarted",
      "description": " - returns 1 if Oblivion was exited and restarted since the last time this call was made from the calling script. Use this condition to reset or undo changes made by OBSE functions which are not stored in the savegame."
    },
    {
      "name": "GetOBSEVersion",
      "description": " - returns the version number of OBSE"
    },
    {
      "name": "GetOBSERevision",
      "description": " - returns the minor version number of OBSE. For instance, when running the second released version of v0014, this function returns 2."
    },
    {
      "name": "SetNumericGameSetting",
      "description": " - sets the specified game setting to the following variable or direct value"
    },
    {
      "name": "GetStringGameSetting",
      "description": " - returns the string value of a game setting"
    },
    {
      "name": "SetStringGameSettingEX",
      "description": " - sets the string value of a game setting. The new string value is contained within the format string, following the setting name and separated by a pipe character, i.e. "
    },
    {
      "name": "GetNumericINISetting",
      "description": " - returns the specified ini setting"
    },
    {
      "name": "SetNumericINISetting",
      "description": " - sets the specified ini setting to the following variable or direct value"
    },
    {
      "name": "GetStringINISetting",
      "description": " - returns the value of a string ini setting"
    },
    {
      "name": "SetStringINISetting",
      "description": " - sets the ini setting to the specified string. Pass both arguments as a single string of the format \"settingName|newValue\". If called from the console, use the \"@\" character in place of the pipe character."
    },
    {
      "name": "GetFPS",
      "description": " - returns the frames per second of the game"
    },
    {
      "name": "IsThirdPerson",
      "description": " - returns whether the point of view is 3rd person or not"
    },
    {
      "name": "IsGlobalCollisionDisabled",
      "description": " - returns whether collision is disabled"
    },
    {
      "name": "SetDisableGlobalCollision",
      "description": " - sets whether to disable the global collision or not"
    },
    {
      "name": "RunBatchScript",
      "description": " - runs a specified text file under the Oblivion directory as a script. Works the same as the console function "
    },
    {
      "name": "IsPluginInstalled",
      "description": " - returns whether a given plugin is installed"
    },
    {
      "name": "GetPluginVersion",
      "description": " - returns the version of the specified plugin"
    },
    {
      "name": "GetDebugSelection",
      "description": " - returns the reference to the item last selected in the console"
    },
    {
      "name": "GetSoundPlaying",
      "description": " - If no parameters are passed, then it dumps a list of the currently playing sounds and actors making sound to obse.log (this may change). If a string is passed, then it returns the number of times the specified sound is playing. The string may contain wildcards:"
    },
    {
      "name": "RunScriptLine",
      "description": " - runs a line of script as if it were called from the console. If bRunOnRef is 1, the line of script will be executed on the calling object, if any. If bSuppressOutput is true, no output will be generated in the console while the script line is executing."
    },
    {
      "name": "GetFormFromMod",
      "description": " - attempts to look up and return a form defined in another mod, prepending the two-digit mod index to the formID. The formID is passed in hexadecimal format, i.e. 0001A46B. The first two digits of the formID are ignored and can be omitted. The file name must include the file extension. Pass \"NONE\" as the file name to look up a dynamic form in the saved game (mod index 0xFF, for example cloned forms)."
    },
    {
      "name": "ToggleFirstPerson",
      "description": " - toggles the player's POV to first or third person. Passing 1 enables first person view, 0 enables third person."
    },
    {
      "name": "GetLastCreatedSpell",
      "description": " - returns the spell most recently created by the player during the current game session"
    },
    {
      "name": "GetLastEnchantedItem",
      "description": " - returns the enchanted item most recently created by the player during the current game session"
    },
    {
      "name": "GetLastCreatedPotion",
      "description": " - returns the potion most recently created by the player during the current game session"
    },
    {
      "name": "GetLastUniqueCreatedPotion",
      "description": " - returns the last "
    },
    {
      "name": "IsConsoleOpen",
      "description": " - returns 1 if the console is currently open"
    },
    {
      "name": "LoadGameEx",
      "description": " - attempts to load the saved game with the specified name"
    },
    {
      "name": "ActorValueToString",
      "description": " - converts an actor value to its localized name"
    },
    {
      "name": "ActorValueToStringC",
      "description": " - converts an "
    },
    {
      "name": "StringToActorValue",
      "description": " - converts the name of an actor value into the actor value code itself"
    },
    {
      "name": "GetEditorID",
      "description": " - attempts to retrieve the editorID for the specified object. EditorIDs for most forms are not loaded at run-time. Currently this function only returns editor IDs for cells and quests - for other types, returns the formID as a string. If the second argument is non-zero, however, returns an empty string instead of the formID."
    },
    {
      "name": "GetEditorID2",
      "description": " - attempts to retrieve the editorID for the specified object. If REID is installed it interrogate it's Interface (TODO more plugins management)."
    },
    {
      "name": "GetFormIDString",
      "description": " - returns the formID of the specified object as a hexadecimal string. If the object cannot be found in memory (for example, a non-persistent reference), returns \"00000000\""
    },
    {
      "name": "GetRawFormIDString",
      "description": " (GetFormIDString2) - returns the formID stored in an array element or ref variable as a hexadecimal string. Unlike GetFormIDString, this command does not care if  the formID is valid."
    },
    {
      "name": "GetUserTime",
      "description": " - returns a StringMap containing information about the time and date on the player's system"
    },
    {
      "name": "ActorValueToCode",
      "description": " - given an actor value name, returns the corresponding "
    },
    {
      "name": "GetGameDifficulty",
      "description": " - returns the current difficulty level of the game as a float from -1.0 to 1.0, with higher values corresponding to greater difficulty."
    },
    {
      "name": "SetGameDifficulty",
      "description": " - sets the current difficulty level of the game as a float from -1.0 to 1.0, with higher values corresponding to greater difficulty. Values outside of the valid range are ignored."
    },
    {
      "name": "GetOblivionDirectory",
      "description": " - returns the full path to the user's Oblivion install"
    },
    {
      "name": "GetWaterShader",
      "description": " - returns information about the current water shader given a string representing one of the water shader properties. Supports the same property names as the ModWaterShader console command: \"direction\", \"velocity\", \"frequency\", \"amplitude\", \"fresnel\", \"reflectivity\", \"opacity\", \"blend\", \"scrollx\", \"scrolly\", \"rainforce\", \"rainvelocity\", \"rainfalloff\", \"rainsize\", \"displaceforce\", \"displacevelocity\", \"displacefalloff\", and \"displacedampener\"."
    },
    {
      "name": "GetGridsToLoad",
      "description": " - returns the effective value of the uGridsToLoad ini setting. This value is specified in Oblivion.ini but adjusted by the game during play."
    },
    {
      "name": "SetOLMPGrids",
      "description": " - specifies the number of grids that a call to OutputLocalMapPicturesOverride should use when generating local map pictures. The value passed in must be smaller than the effective value of the uGridsToLoad ini setting, which can be obtained with GetGridsToLoad. All subsequent calls to OutputLocalMapPicturesOverride will use the new value."
    },
    {
      "name": "OutputLocalMapPicturesOverride",
      "description": " - this command is identical to the console command OutputLocalMapPictures, except it uses the number of grids specified by the last call to SetOLMPGrids when generating the maps."
    },
    {
      "name": "GetWorldSpaceParentWorldSpace",
      "description": " - returns a worldspace's parent worldspace"
    },
    {
      "name": "GlobalVariableExists",
      "description": " - returns 1 if a global variable exists with the specified editorID"
    },
    {
      "name": "GetCellChanged",
      "description": " -returns 1 if the player has entered a new cell since the last time the command was called from the calling script, including transitioning from one exterior cell to another."
    },
    {
      "name": "ResolveModIndex",
      "description": " - Attempts to resolve a mod index which was stored during a previous game session to account for any changes to the user's load order. Given the stored mod index for a mod, returns the mod index currently associated with that same mod, or -1 if the index could not be resolved (for instance, because the mod is no longer loaded)."
    },
    {
      "name": "SetCameraFOV2",
      "description": " - Set Camera FOV without constraints."
    },
    {
      "name": "GetLoadedTypeArray",
      "description": " - Return an array with all Loaded form of type and optionally with specific mod index."
    },
    {
      "name": "CloneForm",
      "description": " - creates and returns a new base object that is an exact copy of the passed objectID"
    },
    {
      "name": "IsClonedForm",
      "description": " - returns whether the passed objectID is a cloned form or not. A cloned form is saved as part of the save game. Instances of cloned forms are player created potions, spells and enchanted items"
    },
    {
      "name": "Label",
      "description": " - save the location of the command following the "
    },
    {
      "name": "Goto",
      "description": " - jump to a previously saved location"
    },
    {
      "name": "While",
      "description": " - evaluates an OBSE expression. If the expression is true, the statements following it will be executed until the next "
    },
    {
      "name": "ForEach",
      "description": " - "
    },
    {
      "name": "Loop",
      "description": " - Returns execution to the most recent "
    },
    {
      "name": "Break",
      "description": " - Must be called inside of a "
    },
    {
      "name": "Continue",
      "description": " - Must be called inside of a "
    },
    {
      "name": "GetFirstRef",
      "description": " - returns the first reference in the current cell. A type can optionally be supplied to return only references matching that type. Additionally, you can pass 69 for actors and 70 for inventory items. This function should only be used either within a "
    },
    {
      "name": "GetNextRef",
      "description": " - returns the next reference in the curent cell. "
    },
    {
      "name": "GetNumRefs",
      "description": " - returns the number of references in the current cell which match the optionally supplied type code. Use 69 for actors and 70 for inventory items. An optional cell depth can be specified for exteriors. By default, inactive references to items which were previously picked up by an actor are ignored; passing 1 for the third parameter will force those references to be included."
    },
    {
      "name": "GetFirstRefInCell",
      "description": " - Works the same as "
    },
    {
      "name": "GetNumRefsInCell",
      "description": " - Works the same as "
    },
    {
      "name": "GetHighActors",
      "description": " - returns an Array containing all actors currently in high AI processing. Generally this is equivalent to all the actors in the currently loaded interior cell or set of exterior cells adjacent to and including the player's current cell. This command is more efficient than using GetFirst/NextRef."
    },
    {
      "name": "GetMiddleHighActors",
      "description": " - returns an Array containing all actors currently in middle high AI processing. This generally includes all actors in cells that are not currently loaded but which have recently been visited by the player. This command is more efficient than using GetFirst/NextRef."
    },
    {
      "name": "GetLowActors",
      "description": " - returns an Array containing all actors currently in low AI processing. This generally includes actors on unloaded cells. This command is more efficient than using GetFirst/NextRef."
    },
    {
      "name": "IsKeyPressed",
      "description": " - returns whether the specified key is currently pressed. Uses standard windows key codes."
    },
    {
      "name": "IsKeyPressed2",
      "description": " - returns whether the specified key is currently pressed. Uses DX scancodes. Detect Tapped/Hold/Hammered keys but not Disabled keys"
    },
    {
      "name": "GetKeyPress",
      "description": " - returns the DX scan code of the key being pressed. If more than one key is pressed use whichIndex to choose which keycode to return."
    },
    {
      "name": "GetNumKeysPressed",
      "description": " - returns the number of keys currently pressed"
    },
    {
      "name": "DisableKey",
      "description": " - disables the key with the specified dx scancode"
    },
    {
      "name": "EnableKey",
      "description": " - enables the key with the specified dx scancode. Turns off DisableKey."
    },
    {
      "name": "HoldKey",
      "description": " - holds down the key with the specified dx scancode"
    },
    {
      "name": "ReleaseKey",
      "description": " - releases a held key with the specified dx scancode"
    },
    {
      "name": "TapKey",
      "description": " - presses the key with the specidied dx scancode once"
    },
    {
      "name": "HammerKey",
      "description": " - fakes keypresses every other frame of the key with the specified dx scancode"
    },
    {
      "name": "AHammerKey",
      "description": " - fakes keypresses every other frame on the alternate frames from HammerKey of the key with the specified dx scancode"
    },
    {
      "name": "UnHammerKey",
      "description": " - stops hammering the key with the specified dx scancode"
    },
    {
      "name": "GetControl",
      "description": " - returns the dx scancode of the key used for the specified control"
    },
    {
      "name": "GetAltControl2",
      "description": " - returns the dx scancode of the alternate key used for the specified control. Unlike GetAltControl, the return value of this function is a valid DX scan code which requires no further calculation for use with other input functions."
    },
    {
      "name": "GetMouseButtonPress",
      "description": " - returns the dx scancode of the mouse button being pressed. If more than one mouse button is pressed, use whichIndex to choose which code to return"
    },
    {
      "name": "GetNumMouseButtonsPressed",
      "description": " - returns the number of mouse buttons pressed"
    },
    {
      "name": "DisableMouse",
      "description": " - prevents the mouse from moving"
    },
    {
      "name": "EnableMouse",
      "description": " - turns off "
    },
    {
      "name": "MoveMouseX",
      "description": " - moves the mouse horizontally the specified number of pixels"
    },
    {
      "name": "MoveMouseY",
      "description": " - moves the mouse veritcally the specified number of pixels"
    },
    {
      "name": "SetMouseSpeedX",
      "description": " - moves the mouse in the horizontal axis at the specified number of pixels per second"
    },
    {
      "name": "SetMouseSpeedY",
      "description": " - moves the mouse in the vertical axis at the specified number of pixels per second"
    },
    {
      "name": "IsKeyPressed3",
      "description": " - returns 1 if the key or mouse button specified is currently pressed. Just like IsKeyPressed2, but detects disabled keys."
    },
    {
      "name": "IsControlPressed",
      "description": " - returns 1 if either the key or mouse button assigned to the specified control code is currently pressed. Detects disabled keys."
    },
    {
      "name": "DisableControl",
      "description": " - disables both the key and mouse buton assigned to the specified control"
    },
    {
      "name": "EnableControl",
      "description": " - enables the key and mouse button for a control disabled with "
    },
    {
      "name": "OnKeyDown",
      "description": " - registers a script as a listener for input events. Returns 1 for one frame when the passed key or mouse button is pressed. If used by multiple scripts, each script will be informed of the key's state. Will not return true again until the key is released and then pressed again."
    },
    {
      "name": "OnControlDown",
      "description": " - works like "
    },
    {
      "name": "TapControl",
      "description": " - presses the key or mouse button associated with the specified control once"
    },
    {
      "name": "SetControl",
      "description": " - assigns a new key to the specified control. If the specified control already has a key assigned, the key mappings are swapped."
    },
    {
      "name": "SetAltControl2",
      "description": " - assigns a new mouse button to the specified control. If the specified control already has a mouse button assigned, the button mappings are swapped."
    },
    {
      "name": "GetCursorPos",
      "description": " - returns the current X or Y coordinate of the mouse cursor in menu mode. Minumum coordinate is zero, maximum is determined by the user's screen resolution. Specify 'X' or 'Y' for the axis."
    },
    {
      "name": "SetIsControl",
      "description": " - allows mods to register or unregister keys or mouse buttons as custom controls. Other mods can then use "
    },
    {
      "name": "IsControl",
      "description": " - returns 1 if the specified key or mouse button is assigned to a game control, 2 if it has been registered as a custom control by a mod via "
    },
    {
      "name": "IsKeyDisabled",
      "description": " - returns 1 if the key has been disabled using "
    },
    {
      "name": "IsControlDisabled",
      "description": " - returns 1 if thecontrol has been disabled by a call to "
    },
    {
      "name": "GetMouseButtonsSwapped",
      "description": " - returns true if the user has configured his operating system to swap the left and right mouse buttons. Input functions respect the swap configuration."
    },
    {
      "name": "Abs",
      "description": " - returns the absolute value of the argument"
    },
    {
      "name": "Ceil",
      "description": " - returns the nearest whole number above the argument"
    },
    {
      "name": "Exp",
      "description": " - returns e to the power of the argument"
    },
    {
      "name": "Floor",
      "description": " - returns the nearest whole number less than the argument"
    },
    {
      "name": "Log",
      "description": " - returns the natural logarithm of the number"
    },
    {
      "name": "Log10",
      "description": " - returns the base 10 logarithm of the number"
    },
    {
      "name": "Pow",
      "description": " - returns the base raised to the exponents power"
    },
    {
      "name": "Rand",
      "description": " - returns a random number between min and max"
    },
    {
      "name": "SquareRoot",
      "description": " - returns the square root of the argument"
    },
    {
      "name": "Fmod",
      "description": " - returns the floating point modulus of dividend in the given base. This differs from "
    },
    {
      "name": "ACos",
      "description": " - returns the arccosine of the argument. "
    },
    {
      "name": "ASin",
      "description": " - returns the arcsine of the argument. "
    },
    {
      "name": "ATan",
      "description": " - returns the arctangent of the argument. "
    },
    {
      "name": "ATan2",
      "description": " - returns the arctangent of the arguments. "
    },
    {
      "name": "Cos",
      "description": " - returns the cosine of the angle. "
    },
    {
      "name": "Cosh",
      "description": " - returns the hyperbolic cosine of the angle. "
    },
    {
      "name": "Sin",
      "description": " - returns the sine of the angle. "
    },
    {
      "name": "Sinh",
      "description": " - returns the hyperbolic sine of the angle. "
    },
    {
      "name": "Tan",
      "description": " - returns the tangent of the angle. "
    },
    {
      "name": "Tanh",
      "description": " - returns the hyperbolic tangent of the angle. "
    },
    {
      "name": "LeftShift",
      "description": " - shifts the argument left by the specified number of bits. Returns zero if shiftAmount is >= 32."
    },
    {
      "name": "RightShift",
      "description": " - shifts the argument right by the specified number of bits, inserting zeros on the left. Returns zero if shiftAmount is >= 32."
    },
    {
      "name": "LogicalAnd",
      "description": " - returns the bitwise AND of the two arguments"
    },
    {
      "name": "LogicalOr",
      "description": " - returns the bitwise OR of the two arguments"
    },
    {
      "name": "LogicalXor",
      "description": " - returns the bitwise XOR of the two arguments"
    },
    {
      "name": "LogicalNot",
      "description": " - returns the bitwise NOT of the argument"
    },
    {
      "name": "GenerateZeroMatrix",
      "description": "\n- Returns an nm matrix with each element filled with a 0."
    },
    {
      "name": "GenerateIdentityMatrix",
      "description": "\n- Returns a square (nn) matrix with each element along the diagonal (from top-left to bottom-right) filled with a 1, and every other element with 0."
    },
    {
      "name": "GenerateRotationMatrix",
      "description": "\n- Returns a 33 square matrix that can serve as a "
    },
    {
      "name": "VectorMagnitude",
      "description": "\n- Returns the magnitude of a vector (square-root of the sum of the squares of its elements)."
    },
    {
      "name": "VectorNormalize",
      "description": "\n- Returns the normalized version of a vector (each entry of the vector divided by its magnitude). A normalized vector has a magnitude of 1."
    },
    {
      "name": "VectorDot",
      "description": "\n- Returns the "
    },
    {
      "name": "VectorCross",
      "description": "\n- Returns the "
    },
    {
      "name": "ForceRowVector",
      "description": "\n- Takes a one-dimensional array, and returns an equivalent two-dimensional array, where the outer array's only element is the 1d array; i.e. "
    },
    {
      "name": "ForceColumnVector",
      "description": "\n- Takes a one-dimensional array, and returns an equivalent two-dimensional array, where the outer array's elements are each arrays with only one element - each element in the 1d array. I.e., "
    },
    {
      "name": "MatrixTrace",
      "description": "\n- Returns the "
    },
    {
      "name": "MatrixDeterminant",
      "description": "\n- Returns the "
    },
    {
      "name": "MatrixRREF",
      "description": "\n- Returns the "
    },
    {
      "name": "MatrixInvert",
      "description": "\n- Returns the "
    },
    {
      "name": "MatrixTranspose",
      "description": "\n- Returns the "
    },
    {
      "name": "MatrixScale",
      "description": "\n- Returns a matrix scaled by a number, that is, with every element multiplied by that number."
    },
    {
      "name": "MatrixAdd",
      "description": "\n- Returns the sum of two matrices, that is, a matrix where each element is the sum of the elements in the corresponding position in each of the addends. The two matrices must have the same dimensions."
    },
    {
      "name": "MatrixSubtract",
      "description": "\n- Returns the difference of two matrices, that is, a matrix where each element is the difference between the elements in the corresponding position in the terms. The two matrices must have the same dimensions."
    },
    {
      "name": "MatrixMultiply",
      "description": "\n- Returns the product of two matrices using "
    },
    {
      "name": "MessageEX",
      "description": " - prints a formatted message using the extended "
    },
    {
      "name": "MessageBoxEX",
      "description": " - \ndisplays a formatted messagebox using the extended "
    },
    {
      "name": "PrintToConsole",
      "description": " - prints a formatted message to the console using the extended "
    },
    {
      "name": "SetMessageSound",
      "description": " - sets the sound which is to be played by the next call to "
    },
    {
      "name": "SetMessageIcon",
      "description": " - sets the icon which is to be displayed to the left of the text for the next call to "
    },
    {
      "name": "DebugPrint",
      "description": " - prints a message to the console only if debug mode has been enabled for the mod from which the calling script originates. Use "
    },
    {
      "name": "SetDebugMode",
      "description": " - toggles all debug messages on or off for the mod from which the calling script originates. Pass 1 as the argument to turn debug messages on, or 0 to turn them off. Optionally pass the modIndex of the mod for which you wish to toggle messages."
    },
    {
      "name": "Print",
      "description": " - prints a string expression to the console. This is mainly a convenience function to eliminate the need for temporary string variables when printing complex strings using "
    },
    {
      "name": "PrintD",
      "description": " - as "
    },
    {
      "name": "GetModIndex",
      "description": " - returns the mod index of the specified plugin. This is equivalent to the first two digits of the object's formID (when represented in hexadecimal notation)."
    },
    {
      "name": "GetSourceModIndex",
      "description": " - returns the mod index of the plugin from which the specified object originates"
    },
    {
      "name": "GetNumLoadedMods",
      "description": " - returns the number of plugins currently loaded. Used in conjunction with GetModIndex, this can be used to verify load order at run-time."
    },
    {
      "name": "IsModLoaded",
      "description": " - returns 1 if the specified .esp or .esm is currently loaded. String is case-insensitive but must include the file extension."
    },
    {
      "name": "GetNthModName",
      "description": " - returns the filename of the nth loaded mod"
    },
    {
      "name": "SetModLocalData",
      "description": " - sets the data value associated with the specified key for the mod to which the calling script belongs. The key must be a string; the data can be a string, number, or object. Keys are case-insensitive and unique - only one data value can be associated with a particular key. "
    },
    {
      "name": "GetModLocalData",
      "description": " - gets the data value associated with the specified key for the mod to which the calling script belongs. If no data exists for the key, returns 0. "
    },
    {
      "name": "ModLocalDataExists",
      "description": " - returns true if local data exists with the specified key for the mod to which the calling script belongs. "
    },
    {
      "name": "RemoveModLocalData",
      "description": " - removes the data value associated with the specified key for the mod to which the calling script belongs. If no data exists for the key, returns false, otherwise returns true. "
    },
    {
      "name": "GetAllModLocalData",
      "description": " - returns a StringMap consisting of all of the name-value entries for the mod local data associated with the mod to which the calling script belongs. This is a copy of the local data so modifying the array contents will not modify the stored data. "
    },
    {
      "name": "GetHotkeyItem",
      "description": " - returns the item or spell bound to the specified hotkey (1-8)"
    },
    {
      "name": "SetHotkeyItem",
      "description": " - sets a hotkey to the specified spell or item"
    },
    {
      "name": "ClearHotkey",
      "description": " - removes any spell or item bound to the specified hotkey"
    },
    {
      "name": "FileExists",
      "description": " - returns 1 if the specified file exists in the user's installation folder or within one of the BSA archives. Path is relative to the user's install folder, which is \"Bethesda SoftworksOblivion\" by default."
    },
    {
      "name": "GetActiveMenuMode",
      "description": " - returns the "
    },
    {
      "name": "GetActiveMenuSelection",
      "description": " - returns the item in the active menu over which the mouse is currently positioned"
    },
    {
      "name": "GetActiveMenuFilter",
      "description": " - returns the "
    },
    {
      "name": "GetActiveMenuRef",
      "description": " - returns the reference from which the active menu is derived"
    },
    {
      "name": "GetActiveMenuObject",
      "description": " - returns the base object from which the active menu is derived"
    },
    {
      "name": "GetEnchMenuSoulgem",
      "description": " - returns the soulgem selected for enchantment in the enchantment menu. Only works if the enchantment menu is the active menu."
    },
    {
      "name": "GetEnchMenuEnchItem",
      "description": " - returns the enchantment which is to be applied to the item to be enchanted. Only works if the enchantment menu is the active menu."
    },
    {
      "name": "IsBarterMenuActive",
      "description": " - returns 1 if the player is bartering with a merchant, providing a way to distinguish between an ordinary container menu and a barter menu, which both return the same MenuMode code"
    },
    {
      "name": "GetAlchMenuIngredient",
      "description": " - returns one of the four ingredients, from 0 to 3, selected for inclusion in the potion currently being brewed"
    },
    {
      "name": "GetAlchMenuIngredientCount",
      "description": " - returns the number of the specified ingredient selected for inclusion in the potion being brewed. Pass 0 for the first ingredient, 3 for the last."
    },
    {
      "name": "GetAlchMenuApparatus",
      "description": " - returns the apparatus object being used in the brewing process"
    },
    {
      "name": "CloseAllMenus",
      "description": " - closes all currently open menus. Note: if the console is open at the time this function is called, it will be closed but the displayed console text will remain visible until the console is opened and closed again."
    },
    {
      "name": "GetContainerMenuView",
      "description": " - when the container/barter menu is open, returns 1 if the player is viewing his own inventory, or 0 if viewing the container or merchant's inventory"
    },
    {
      "name": "SetButtonPressed",
      "description": " - When any Message menu is displayed (game prompts such as the inventory quantity prompt as well as those created by the "
    },
    {
      "name": "IsGameMessageBox",
      "description": " - returns 1 if a messagebox is currently displayed which was generated by game code (e.g., confirm item purchase) rather than a script"
    },
    {
      "name": "GetMessageBoxType",
      "description": " - returns a code indicating the origin of the currently-displayed messagebox"
    },
    {
      "name": "GetMenuFloatValue",
      "description": " - returns the value of a float or boolean trait of the specified menu"
    },
    {
      "name": "GetMenuStringValue",
      "description": " - returns the value of a string trait of the specified menu"
    },
    {
      "name": "SetMenuFloatValue",
      "description": " - sets the value of a float or boolean trait of the specified menu"
    },
    {
      "name": "SetMenuStringValue",
      "description": " - sets the value of a string trait of the specified menu. The new value follows the trait name, separated from it by a pipe character. i.e. \"elementName\traitName|newValue\". (If calling from the console, replace the pipe character with the '@' character)."
    },
    {
      "name": "GetActiveUIComponentID",
      "description": " - returns the integer ID of the menu elemented currently highlighted by the mouse cursor as defined by that element's <id> trait in the menu XML file."
    },
    {
      "name": "GetActiveUIComponentName",
      "description": " - returns the name of the menu element currently highlighted by the mouse cursor as defined in the menu XML file."
    },
    {
      "name": "GetActiveUIComponentFullName",
      "description": " - like GetActiveUIComponentName, returns the name of the menu element currently highlighted by the mouse cursor, if any. However the returned name is fully qualified with the names of the element's parents in a form suitable to pass to commands like GetMenuFloatValue. i.e., if button_1 is highlighted in the MessageMenu, this command returns \"background\button_1\"."
    },
    {
      "name": "ClickMenuButton",
      "description": " - simulates the user clicking on the specified UI component. Pass the fully qualified component name as described above, or pass the <id> trait of the desired component as specified in the XML, preceded by a '#'; i.e. \""
    },
    {
      "name": "GetMenuHasTrait",
      "description": " - returns 1 if the menu has the trait specified. The trait name may be qualified with component names to access traits of subcomponents."
    },
    {
      "name": "GetTileChildren",
      "description": " - given a UI component (referred to by the game as a \"Tile\"), returns an Array containing the names of all of the direct subcomponents of that component. Using this command is more efficient than accessing children individually if you need to inspect more than one subcomponent."
    },
    {
      "name": "GetTileTraits",
      "description": " - given a UI component, returns a StringMap representing all of that component's traits and their values. The keys of the returned StringMap's elements are the names of the traits; their values are the string or numeric values of the traits. This command is more efficient for accessing multiple traits of the same component than the commands which access traits individually."
    },
    {
      "name": "PrintTileInfo",
      "description": " - a debugging command which outputs all of the children of a UI component as well as the names and values of all of its traits. Output is sent to the console and to obse.log. Avoid using this function in released mods; it is intended for testing and debugging only."
    },
    {
      "name": "PrintActiveTileInfo",
      "description": " - a debugging command which outputs all of the children of the UI component currently under the mouse cursor as well as the names and values of all of its traits. Output is sent to the console and to obse.log. Avoid using this function in released mods; it is intended for testing and debugging only."
    },
    {
      "name": "GetMapMenuMarkerName",
      "description": " - when the world map menu is visible and a location icon is highlighted by the mouse, this command returns the name of the highlighted icon. At all other times it returns an empty string."
    },
    {
      "name": "GetMapMenuMarkerRef",
      "description": " - when the world map menu is visible and a location icon is highlighted by the mouse, this command returns a reference to the MapMarker reference associated with the highlighted icon. This is a slow function, so avoid calling it repeatedly. If you want to detect changes in the currently highlighted map icon, it is best to check GetMapMenuMarkerName over the course of several frames, and only call GetMapMenuMarkerRef if the name changes and is not an empty string."
    },
    {
      "name": "GetBarterItem",
      "description": " - returns the active item in a container menu"
    },
    {
      "name": "GetBarterItemQuantity",
      "description": " - returns the selected quantity of the active item in a container menu"
    },
    {
      "name": "GetLastTransactionItem",
      "description": " - returns the item most recently confirmed for buying or selling by the player. Note that this transaction may not have been completed due to the purchaser having insufficient gold or attempting to sell a quest item. Use "
    },
    {
      "name": "GetLastTransactionQuantity",
      "description": " - returns the quantity of the most recent buy/sell transaction confirmed by the player. Note that the transaction may not have been completed due to the purchaser having insufficient gold or attempting to sell a quest item. Use "
    },
    {
      "name": "GetTransactionInfo",
      "description": " - returns information about the most recent barter transaction completed by the player as a Stringmap. Specify \"buy\" for information about the player's most recent purchase, or \"sell\" for his most recent sale to a merchant. Once a transaction has been returned to a particular script, subsequent calls to this function requesting the same type of transaction (\"buy\" or \"sell\") will return zero until a new transaction of that type takes place. The returned Stringmap contains the following information:"
    },
    {
      "name": "GetQMCurrent (GetQuantityMenuCurrentQuantity)",
      "description": " - returns the current quantity in the quantity menu"
    },
    {
      "name": "GetQMMaximum (GetQuantityMenuMaximumQuantity)",
      "description": " - returns the maximum quantity in the quantity menu"
    },
    {
      "name": "GetQMItem (GetQuantityMenuItem)",
      "description": " - returns the active item in the quantity menu"
    },
    {
      "name": "GetClassMenuSelectedClass",
      "description": " - while the class selection menu is visible, returns the class which would be selected by the player if he were to click 'Done'."
    },
    {
      "name": "GetClassMenuHighlightedClass",
      "description": " - while the class selection menu is visible, returns the class over which the cursor is currently positioned, if any."
    },
    {
      "name": "GetEnchMenuBaseItem",
      "description": " - while the enchantment menu is visible, returns the unenchanted item selected by the player as the target of the enchantment."
    },
    {
      "name": "UpdateContainerMenu",
      "description": " - if called while a container or barter menu is displayed, updates the contents of the menu. In barter mode this recalculates prices and quantities of available items."
    },
    {
      "name": "UpdateSpellPurchaseMenu",
      "description": " - when called while the spell purchase menu is visible, updates the contents of the menu to reflect changes in prices"
    },
    {
      "name": "OpenTextInput",
      "description": " - opens a text input menu if one is not currently in use. MenuType is 0 for a messagebox, 1 for a book, or 2 for a scroll. The MaxLength parameter specifies how many characters to allow the user to enter. For messageboxes, the prompt string will be displayed before the cursor and cannot be erased. It may also contain buttons, with the button text separated from the prompt text with pipe '|' characters as in "
    },
    {
      "name": "IsTextInputInUse",
      "description": " - returns 1 if a script is currently using a text input menu, regardless of whether or not the menu is visible. Only one script may request text input at a time."
    },
    {
      "name": "GetInputText",
      "description": " - returns the text entered by the user. You may call this function at any point before calling "
    },
    {
      "name": "UpdateTextInput",
      "description": " - tells the text input menu to check for user input and refresh the displayed text if necessary. In general, unless you want to temporarily disallow input, this command should be called every frame while the text input menu is open."
    },
    {
      "name": "CloseTextInput",
      "description": " - closes the text input menu, releasing it for use by other scripts. Be sure to call this command when you are done getting input."
    },
    {
      "name": "InsertInInputText",
      "description": " - inserts formatted text at the current cursor position in the text input menu, as long as doing so would not increase the length of the text beyond its maximum length."
    },
    {
      "name": "GetTextInputControlPressed",
      "description": " - allows scripters to define custom controls for text input. Returns the scan code of the last key pressed in conjunction with the CTRL key, excluding those keys reserved for use by the text input menu. Once the code has been retrieved, subsequent calls to this command will return -1; it will also return -1 if no control has been pressed (similar to "
    },
    {
      "name": "DeleteFromInputText",
      "description": " - deletes a number of characters or words from the input text in the direction specified, beginning from the current cursor position. Note that an html tag is treated as both a word and a character (it is not possible to delete only part of a tag). Both optional parameters are false by default."
    },
    {
      "name": "GetTextInputCursorPos",
      "description": " - returns the current position of the cursor as an index into the input string"
    },
    {
      "name": "MoveTextInputCursor",
      "description": " - moves the cursor a specified number of characters in the specified direction from its current position. Note that each html tag is treated as a single character."
    },
    {
      "name": "SetInputText",
      "description": " - replaces any text which has been input by the user with the specified text and repositions the cursor to the specified position. If the specified position is invalid (e.g. greater than the length of the text, or inside an html tag), returns false without modifying the input text; otherwise returns true. For books, the text must be in an appropriate format - no invalid html tags should be present and the text must be prefixed with html of the format "
    },
    {
      "name": "SetTextInputHandler",
      "description": " - registers a function script to handle control-key combos pressed while the current text input menu is active. The function script should accept a single integer argument; when a key is pressed in conjunction with the Control key, that key's scan code will be passed to the function script. The script will not be informed of control-key combos which are handled by OBSE (for instance, ctrl+5 to change to font #5) unless the default controls have been disabled with SetTextInputDefaultControlsDisabled. The function script is unregistered when the text input menu is closed."
    },
    {
      "name": "SetTextInputDefaultControlsDisabled",
      "description": " - sets whether or not OBSE responds to control-key combos it recognizes, such as ctrl+(number) for changing the font. While default controls are disabled, they will be passed to the function script registered with SetTextInputHandler or stored for retrieval using GetTextInputControlPressed. This setting is reset when the text input menu is closed."
    },
    {
      "name": "sv_Construct",
      "description": " - constructs a string from a format string and set of variables and assigns the result to a string variable."
    },
    {
      "name": "sv_Destruct",
      "description": " - destroys a string variable, setting its value to zero and preventing its contents from being saved in the savegame. Two different syntaxes are supported: the first should be used in an assignment with no parameters, using the "
    },
    {
      "name": "sv_Length",
      "description": " - returns the number of characters in a string variable"
    },
    {
      "name": "sv_Compare",
      "description": " - compares a string to a formatted string. Performs a case-insensitive comparison by default. Returns 0 if the strings are equal, 1 if the string variable occurs alphabetically before the formatted string, -1 if the string variable occurs alphabetically after the formatted string, or -2 if the comparison fails."
    },
    {
      "name": "sv_Erase",
      "description": " - erases the specified number of characters from a string starting at the specified position. If omitted, "
    },
    {
      "name": "sv_ToNumeric",
      "description": " - attempts to convert the contents of a string variable to a number. Valid characters include digits, a leading sign, and an e to indicate scientific notation. Conversion halts at the first invalid character."
    },
    {
      "name": "sv_Find",
      "description": " - returns the index of the first occurrence of a substring within a string variable, starting at the specified position and only including occurrences contained completely within the range ["
    },
    {
      "name": "sv_Count",
      "description": " - returns the number of occurrences of a substring within a string variable, using the same arguments as "
    },
    {
      "name": "sv_Replace",
      "description": " - replaces occurrences of a string1 with string2 within a string variable. Both the text to replace and that with which to replace it are passed in a single format string separated by a pipe character as in \"toReplace|replaceWith\" (when calling from the console, use '@' in place of the pipe character). You can specify a range to search and case-sensitivity as in "
    },
    {
      "name": "sv_Insert",
      "description": " - inserts a substring into a string at the specified position, provided the position is less than the length of the string, or prepends it if no position is specified."
    },
    {
      "name": "sv_Split",
      "description": " - given a string and a set of delimiters, returns an Array containing all the substrings separated by one or more of the delimiting characters. For example, "
    },
    {
      "name": "GetKeyName",
      "description": " - returns the name of a key given its DirectInput scan code"
    },
    {
      "name": "AsciiToChar",
      "description": " - returns the character associated with an ASCII code as a string"
    },
    {
      "name": "NumToHex",
      "description": " - returns a string representation of an integer in hexadecimal format. An optional "
    },
    {
      "name": "sv_Percentify",
      "description": " - Takes an input string and returns it with each '%' character replaced by two '%' characters. For instance, \"100% gold\" becomes \"100%% gold\" and \"99.99%%\" becomes \"99.99%%%%\". The argument can be any expression evaluating to a string value."
    },
    {
      "name": "sv_ToLower",
      "description": " - returns the passed string with all characters converted to lowercase."
    },
    {
      "name": "sv_ToUpper",
      "description": " - returns the passed string with all characters converted to uppercase."
    },
    {
      "name": "IsDigit",
      "description": " - returns 1 if the character is a digit"
    },
    {
      "name": "IsPunctuation",
      "description": " - returns 1 if the character is punctuation"
    },
    {
      "name": "IsUppercase",
      "description": " - returns 1 if the character is an uppercase letter"
    },
    {
      "name": "IsPrintable",
      "description": " - returns 1 if the character is printable (not a non-printable control character)"
    },
    {
      "name": "IsLetter",
      "description": " - returns 1 if the character is alphabetic"
    },
    {
      "name": "CharToASCII",
      "description": " - returns the ASCII code of a character passed as a string. Additional characters in the string are ignored."
    },
    {
      "name": "ToUpper",
      "description": " - returns the ASCII code of a character converted to uppercase"
    },
    {
      "name": "ToLower",
      "description": " - returns the ASCII code of a character converted to lowercase"
    },
    {
      "name": "ToNumber",
      "description": " - takes a string expression and attempts to convert it to a numeric value. By default the string is assumed to be in decimal notation containing digits, at most one decimal point, and an optional leading sign. If the string is prefixed with \"0x\" or the optional argument is non-zero, the string is interpreted in hexadecimal notation instead, with valid characters consisting of digits and the letters 'A' through 'F'. Returns 0 if the conversion fails."
    },
    {
      "name": "ar_Construct",
      "description": " - creates a new array_var and assigns it to an array variable. Must be called within the context of an OBSE expression such as "
    },
    {
      "name": "ar_Size",
      "description": " - returns the number of elements in an array, or -1 if the array is not initialized. For Array-type variables the highest key in the array is equal to one less than the array's size. Must be called within the context of an OBSE expression. The array can be an array variable or an array element which contains an array."
    },
    {
      "name": "ar_Dump",
      "description": " - for debugging purposes, prints the key and value of every element in an array to the console. Must be called within an OBSE expression."
    },
    {
      "name": "ar_DumpID",
      "description": " - does the same as ar_Dump but accepts an array ID instead of an array_var. Provided as a convenience for debugging in the console."
    },
    {
      "name": "ar_Find",
      "description": " - locates the first occurrence of the specified value within an array and returns the key associated with it. A range may optionally be specified using range notation, i.e. "
    },
    {
      "name": "ar_Sort",
      "description": " - attempts to sort the elements of an array in ascending or descending order and returns a new Array containing the elements in sorted order (keys associated with the elements are lost). In order to be sorted all elements of an array must be of the same type (strings, numbers, or objects). If this condition is not met an empty Array is returned. Strings are sorted alphabetically and case-insensitively, numbers are sorted numerically, and objects are sorted by formID. By default the elements are sorted in ascending order."
    },
    {
      "name": "ar_SortAlpha",
      "description": " - sorts the elements of an array alphabetically in ascending or descending order and returns a new Array containing the elements in sorted order. Ordering is case-insensitive. Unlike "
    },
    {
      "name": "ar_Copy",
      "description": " - creates a copy of the keys and elements of the specified array. The resulting array is identical to the source array. If the source array contains other arrays, the copy will contain "
    },
    {
      "name": "ar_DeepCopy",
      "description": " - performs the same function as "
    },
    {
      "name": "ar_First",
      "description": " - returns the key of the first element in an array"
    },
    {
      "name": "ar_Last",
      "description": " - returns the key of the last element in an array"
    },
    {
      "name": "ar_Next",
      "description": " - returns the key of the element immediately following the passed key, or "
    },
    {
      "name": "ar_Prev",
      "description": " - returns the key of the element immediately preceding the passed key, or "
    },
    {
      "name": "ar_BadNumericIndex",
      "description": " - returns a constant representing an invalid numeric array index. Compare to the return value of commands returning an array key to determine if a valid key was returned."
    },
    {
      "name": "ar_BadStringIndex",
      "description": " - as above, but for string array keys"
    },
    {
      "name": "ar_Keys",
      "description": " - returns an Array containing all of the keys of the source array"
    },
    {
      "name": "ar_HasKey",
      "description": " - returns true if the array has an element with the specified key"
    },
    {
      "name": "ar_Null",
      "description": " - returns an invalid array. This is useful if you wish to specify that a variable which previously referred to an array should no longer refer to any array."
    },
    {
      "name": "ar_List",
      "description": " - Takes up to twenty arguments of any type and returns an Array containing those elements in the order in which they were passed. We recommend separating the values with commas (starting after the first argument)."
    },
    {
      "name": "ar_Resize",
      "description": " - resizes an Array-type array to be of the specified size. If the new size is smaller than the current size, elements at the end of the array are discarded. If the new size is larger, additional elements are appended to the array. By default these elements have the numeric value zero, but an optional argument can be used to specify the value with which to pad the array. Returns 1 if successful, 0 otherwise."
    },
    {
      "name": "ar_Insert",
      "description": " - inserts a single element into an Array-type array at the specified index provided the index is not greater than the current size of the array. Elements above the index are shifted up by one index."
    },
    {
      "name": "ar_InsertRange",
      "description": " - inserts a range of elements into an Array-type array at the specified index provided the index is not greater than the current size of the array. The range is passed as an Array. Each element of the range is inserted into the target Array in order. Elements above the insertion index are shifted up by the number of elements inserted."
    },
    {
      "name": "ar_Range",
      "description": " - returns an Array of zero or more numbers ranging from "
    },
    {
      "name": "ar_CustomSort",
      "description": " - returns an Array sorted by calling the provided function script to perform comparison of elements. The function should be defined to take two array_var arguments. When it is called, the arguments will contain exactly one element each - the elements to be compared. It should return true if the first argument is less than the second argument, and true if it is greater than or equal to the second argument. You can define 'less', 'greater', and 'equal' in whatever way makes sense for you provided your definitions provide a definitive ordering of any set of values; otherwise the sort may never terminate. The optional third argument sorts the elements in reverse order. "
    },
    {
      "name": "Let",
      "description": " - The Let statement is OBSE's version of Oblivion's "
    },
    {
      "name": "Eval",
      "description": " - "
    },
    {
      "name": "TestExpr",
      "description": " - attempts to evaluate an expression, returning false if an error occurs during evaluation and true otherwise. This can be useful when checking if an array index is out of bounds or if an element exists with a given key, among other things. "
    },
    {
      "name": "ToString",
      "description": " - attempts to convert an expression to a string. For numeric expressions, the result is a string representation of the numeric value. For objects, it is the name of the object if available; otherwise it is the formID expressed in hexadecimal notation. For string expressions no conversion is necessary."
    },
    {
      "name": "TypeOf",
      "description": " - returns a string representing the type of an expression. This is mainly useful for determining the type of an array element at run-time. Possible return values: \"String\", \"Number\", \"Form\", \"Array\", \"StringMap\", \"Map\"."
    },
    {
      "name": "Function",
      "description": " - a blocktype which precedes the body of a function. This blocktype is only valid within function scripts. A parameter list consisting of up to ten local variables used to hold arguments passed to the function must follow this keyword enclosed in curly braces; if the function takes no arguments the braces should be empty."
    },
    {
      "name": "SetFunctionValue",
      "description": " - specifies the value to be returned from a function. Valid only within a "
    },
    {
      "name": "Call",
      "description": " - calls a user-defined function. Should be followed by a list of arguments matching the types expected by the function. If a calling reference is specified, commands within the function body will operate on that reference. Call returns whatever value is returned by the function."
    },
    {
      "name": "GetCallingScript",
      "description": " - returns the script that called the currently executing function script. Returns nothing if the function script was not invoked by a "
    },
    {
      "name": "SetEventHandler",
      "description": " - registers a user-defined function as a handler for the specified event. If the function script returns a value, it will be ignored. Two optional arguments can be supplied as key::value pairs to filter events according to the target and/or object."
    },
    {
      "name": "RemoveEventHandler",
      "description": " - removes the specified script as an event handler for the specified event. Two optional arguments can be supplied as key::value pairs to filter events according to the target and/or object. If both filters are omitted, all event handlers matching the script and event will be removed. If only one filter is omitted, all handlers matching the script, event, and the other filter will be removed. Returns true if at least one matching event handler was found and removed, false otherwise."
    },
    {
      "name": "GetCurrentEventName",
      "description": " - When called from within an event handler, returns the name of the event currently being handled, as defined "
    },
    {
      "name": "DispatchEvent",
      "description": " - dispatches a user-defined event to any registered listeners. The eventName parameter specifies the event that occurred; this should be fairly unique to prevent event name clashes between different mods, but the event handler can also disambiguate name clashes by checking the name of the event sender if necessary. The optional second parameter is a StringMap containing any additional information about the event. When the event is dispatched, the array will also include the event name and the name of the sender. If omitted, the name of the sender is the filename from which the event originated; otherwise it matches the supplied third argument."
    },
    {
      "name": "RemoveMeIR",
      "description": " - removes an inventory reference from its container, optionally transferring it to a different container, in much the same way as the vanilla RemoveMe command. The inventory reference becomes invalid once this command is called and should no longer be used. This command will not remove "
    },
    {
      "name": "CopyIR",
      "description": " - copies an inventory reference to the specified container. The calling object needn't be in a container and remains valid after the command is called. If the calling object is equipped, the copy will not be equipped."
    },
    {
      "name": "CreateTempRef",
      "description": " - creates a temporary reference to the specified form. This reference does not exist in the gameworld or in a container, and remains valid for only one frame. It is mostly useful for creating a stack of one or more items to be added to a container with CopyIR"
    },
    {
      "name": "GetInvRefsForItem",
      "description": " - given a base inventory item, returns an Array of temporary references to stacks of that item inside the calling container."
    },
    {
      "name": "IsEquipped",
      "description": " - returns true if the calling object is currently being worn"
    },
    {
      "name": "GetLocalGravity",
      "description": " - returns the acceleration due to gravity in the specified axis for the current cell. Unless SetLocalGravityVector has been used, the x and y components will always be zero."
    },
    {
      "name": "SetLocalGravity",
      "description": " - sets the vertical acceleration due to gravity for the current cell. Negative values are the norm, causing objects to accelerate downward, but positive values are also acceptable. Changing the gravity for an exterior cell changes it for "
    },
    {
      "name": "SetLocalGravityVector",
      "description": " - sets the x, y, and z components of local acceleration due to gravity. This can be used to cause gravity to act in a non-vertical direction, which might be useful for simulating water currents."
    },
    {
      "name": "GetVelocity",
      "description": " - returns the actor's current velocity in the specified axis."
    },
    {
      "name": "GetVerticalVelocity",
      "description": " - returns the z component of the actor's current velocity."
    },
    {
      "name": "SetVelocity",
      "description": " - sets the x, y, and z components of the actor's velocity. The change applies only to the current frame."
    },
    {
      "name": "SetVerticalVelocity",
      "description": " - Sets the vertical velocity for an actor. This is primarily useful for actors who are jumping or falling. Positive values will cause the actor to move upwards, negative values will cause him to move downwards, and zero will prevent him from moving vertically for the current frame. On the subsequent frame, acceleration due to gravity will be applied to the new velocity. This means that if you set a falling actor's velocity to zero, on the next frame he will appear to accelerate as if he had just begun falling."
    }
  ]
}